import Image from "next/image";

const questions = [
                    {
                      question: "1. कोशिका किसे कहते हैं?",
                      answer: (
                        <div>
                          <b style={{ color: "green" }}>उत्तर:—</b> कोशिका को सभी जीवों की आधारभूत संरचनात्मक और क्रियात्मक इकाई माना गया है जिसे कोशिका कहते हैं।
                          <br />
                          <ul>
                            <li>सभी जीव का शरीर कोशिका का बना होता है।</li>
                          </ul>
                        </div>
                      ),
                    },
                    {
                      question: "2. कोशिकाओं में विविधता के बारे में लिखें?",
                      answer: (
                        <div>
                          <b style={{ color: "green" }}>उत्तर:—</b> कोशिकाओं के रूप और आकार में काफी भिन्नता होती है। यह कम से कम 0.1 माइक्रोमीटर का होता है।
                        </div>
                      ),
                    },
                    {
                      question: "3. एक कोशिकीय जीव किसे कहते हैं?",
                      answer: (
                        <div>
                          <b style={{ color: "green" }}>उत्तर:—</b> जिन जीवों का शरीर एक कोशिका का बना होता है, उसे एक कोशिकीय जीव कहते हैं।
                          <br />
                          <b style={{color: "violet"}}>जैसे:—</b> अमीबा, पैरामिशियम आदि।
                        </div>
                      ),
                    },
                      {
                        question: "4. बहुकोशिकीय जीव किसे कहते हैं?",
                        answer: (
                          <div>
                            <b style={{ color: "green" }}>उत्तर:—</b> जिन जीवों का शरीर एक से अधिक कोशिकाओं का बना होता है, उसे बहुकोशिकीय जीव कहते हैं।
                            <br />
                            <b style={{ color: "violet" }}>जैसे:—</b> शैवाल, कवक, मॉस आदि।
                          </div>
                        ),
                      },
                      {
                        question: "5. ऊतक किसे कहते हैं?",
                        answer: (
                          <div>
                            <b style={{ color: "green" }}>उत्तर:—</b> एक ही प्रकार की कोशिकाओं के समूह को ऊतक कहते हैं।
                          </div>
                        ),
                      },
                      {
                        question: "6. अंग किसे कहते हैं?",
                        answer: (
                          <div>
                            <b style={{ color: "green" }}>उत्तर:—</b> उत्तकों के समूह, जो किसी विशेष कार्य को संपन्न करते हैं तथा जिनका विशिष्ट संरचनात्मक संगठन होता है, अंग कहलाते हैं।
                          </div>
                        ),
                      },
                      {
                        question: "7. पाचन तंत्र किसे कहते हैं?",
                        answer: (
                          <div>
                            <b style={{ color: "green" }}>उत्तर:—</b> मुख, अमाशय, आँत, यकृत आदि सामूहिक रूप से एक विशेष तंत्र की रचना करते हैं जिसे पाचन तंत्र कहते हैं।
                          </div>
                        ),
                      },
                      {
                        question: "8. जीव का निर्माण कैसे होता है?",
                        answer: (
                          <div>
                            <b style={{ color: "green" }}>उत्तर:—</b> 
                            <span>
                              श्‍वसन तंत्र, परिसंचरण तंत्र, उत्सर्जन तंत्र, सभी अंग–तंत्र मिलकर जीव का निर्माण करते हैं।
                            </span>
                            <p className="ml-12">
                            <b style={{ color: "violet" }}>मुख्य बिंदु:</b> श्‍वसन तंत्र, परिसंचरण तंत्र, उत्सर्जन तंत्र।
                            </p>
                          </div>
                        ),
                      },
        {
          question: "9. कोशिका की खोज किसने और कब किया?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कोशिका की खोज रॉबर्ट हुक ने सन 1665 ई० में किया। वे एक अंग्रेज वैज्ञानिक थे, जिन्होंने माइक्रोस्कोप का निर्माण किया।
              <ul style={{ color: "" }}>
                <li>
                  माइक्रोस्कोप में कॉर्क की एक पतली काट में अनेक सूक्ष्म, मोटी भित्ति वाले, मधुमक्खी की छत्ते जैसी कोठरियाँ देखीं। इन कोठरियों को सेल नाम दिया गया।
                </li>
                <li>सन 1674 में डच वैज्ञानिक ने माइक्रोस्कोप में कोशिकाओं को देखा।</li>
                <li>
                  1839 में कोशिका के अंदर अर्धतरल, दानेदार सजीव पदार्थ को **जीवद्रव्य** नाम दिया गया।
                </li>
              </ul>
            </div>
          ),
        },
        {
          question: "10. कोशिकांग किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कोशिका का निर्माण विभिन्न घटकों से होता है, जिन्हें कोशिकांग कहते हैं।
            </div>
          ),
        },
        {
          question: "11. कोशिका को कितने भागों में बांटा गया है?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कोशिका को तीन भागों में बांटा गया है:
              <ul >
                <li>कोशिका झिल्ली</li>
                <li>कोशिका द्रव्य</li>
                <li>केंद्रक</li>
              </ul>
              <b >कोशिका झिल्ली:</b> प्रत्येक कोशिका के सबसे बाहर चारों ओर एक पतली मुलायम और लचीली झिल्ली होती है, जिसे कोशिका झिल्ली कहते हैं।
              <br />
              <b>कार्य:</b>
              <ol >
                <li>यह एक सीमित झिल्ली का कार्य करती है।</li>
                <li>कोशिका को निश्चित आकार बनाए रखने में सहायता करती है।</li>
                <li>कोशिका को यांत्रिक सहायता प्रदान करती है।</li>
              </ol>
            </div>
          ),
        },
        {
          question: "11. कोशिका भित्ति किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> पादप कोशिकाएँ चारों ओर से एक मोटे और कठोर आवरण द्वारा घिरी होती हैं, जिसे कोशिका भित्ति कहते हैं।
              <br />
              <b>कार्य:</b>
              <ol >
                <li>कोशिका को निश्चित रूप प्रदान करती है।</li>
                <li>कोशिका को सुरक्षा और सहारा देती है।</li>
                <li>कोशिका झिल्ली की रक्षा करती है।</li>
              </ol>
            </div>
          ),
        },
        {
          question: "12. कोशिका द्रव्य या साइटोप्लाज्म किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> जीवद्रव्य का वह भाग जो कोशिका भित्ति और केंद्रक के बीच होता है, उसे कोशिका द्रव्य या साइटोप्लाज्म कहते हैं। इसमें:
              <ul >
                <li>खनिज लवण और जल (अकार्बनिक पदार्थ)</li>
                <li>वसा और प्रोटीन (कार्बनिक पदार्थ)</li>
              </ul>
              पाए जाते हैं।
            </div>
          ),
        },
        {
          question: "13. कोशिकांगक किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कोशिका द्रव्य में छोटी-छोटी संरचनाओं को कोशिकांगक कहते हैं।
            </div>
          ),
        },
        {
          question: "14. राइबोसोम किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> राइबोसोम ऐसे कण हैं जो केवल इलेक्ट्रॉन सूक्ष्मदर्शी में ही दिखाई पड़ते हैं। ये अंतः प्रद्रव्य जालिका की झिल्लियों की सतह पर सटे होते हैं या कोशिका द्रव्य में गुच्छों में बिखरे रहते हैं।
             <br /> <b style={{color:"violet"}}>कार्य:</b> राइबोसोम में प्रोटीन का संश्लेषण होता है।
            </div>
          ),
        },
          {
            question: "15. गॉल्जी उपकरण या गॉल्जीकाय किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> सर्वप्रथम कैमिलो गॉल्जी ने 1898 में जंतु कोशिका में गॉल्जी उपकरण को देखा। साधारण सूक्ष्मदर्शी में यह मुड़ी हुई छड़ के गुच्छा के समान प्रतीत होता है।
                <br /><b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>यह कोशिका का मुख्य स्त्रवण अंगक है।</li>
                  <li>लाइसोसोम और पेरॉक्सिसोम के निर्माण में मदद करता है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "16. माइटोकॉण्ड्रिया क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> माइटोकॉण्ड्रिया कोशिका द्रव्य में पाई जाने वाली महत्वपूर्ण संरचना है। यह प्रकाश सूक्ष्मदर्शी में सूक्ष्म कण, धागेनुमा, दानेदार या गोलाकार दिखाई देती है।
               <br /> <b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>कोशिकीय श्वसन के एंजाइम्स के चलते भोजन का संपूर्ण ऑक्सीकरण होता है।</li>
                  <li>यह ऊर्जा को ATP (Adenosine Triphosphate) के रूप में संग्रहित करता है।</li>
                  <li>माइटोकॉण्ड्रिया को &quot; कोशिकीय पावरहाउस &quot; कहा जाता है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "17. लाइसोसोम किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> यह बहुत सूक्ष्म कोशिकांग है जिसे 1958 में क्रिश्चियन डि ड्यूवे ने देखा। ये छोटी-छोटी पुटिकाओं के रूप में पाए जाते हैं, जिनके चारों ओर पतली झिल्ली होती है।
                <br /><b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>कोशिका में प्रवेश करने वाले बड़े कणों और बाह्य पदार्थों का पाचन करता है।</li>
                  <li>अंतः कोशिकीय पदार्थों और अंगकों के टूटे-फूटे भागों को पचाकर कोशिका को साफ करता है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "18. लवक या प्लैस्टिड किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> लवक या प्लैस्टिड केवल पादप कोशिकाओं में पाए जाते हैं। ये कोशिका द्रव्य में बिखरे रहते हैं और अंडाकार या गोलाकार होते हैं।
                <b style={{color:"blue"}}>यह तीन प्रकार के होते हैं:</b>
                <ul >
                  <li>अवर्णीलवक</li>
                  <li>वर्णीलवक</li>
                  <li>हरितलवक</li>
                </ul>
                <b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>ल्यूकोप्लास्ट मुख्यतः जड़ की कोशिकाओं में पाया जाता है।</li>
                  <li>क्रोमोप्लास्ट फूलों और बीजों को विभिन्न रंग प्रदान करता है।</li>
                  <li>क्लोरोप्लास्ट मुख्यतः पत्तियों में पाया जाता है और भोजन संश्लेषण में सहायक है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "19. रसधानी किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> कोशिका की रसधानियाँ चारों ओर से एक झिल्ली से घिरी होती हैं, जिसे टोनोप्लास्ट कहते हैं। इनके भीतर ठोस और तरल पदार्थ भरे रहते हैं। <br />
                <b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>जंतु कोशिका में जल संतुलन बनाए रखती है।</li>
                  <li>कोशिका रस में मौजूद विभिन्न पदार्थों को कोशिका द्रव्य से अलग रखती है।</li>
                  <li>पादप कोशिकाओं में स्फीति और कठोरता प्रदान करती है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "20. केंद्रक या न्यूक्लियस किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> कोशिका द्रव्य के बीच एक बड़ी, गोल, गाढ़ी संरचना पाई जाती है जिसे केंद्रक कहते हैं।
              </div>
            ),
          },
          {
            question: "21. केंद्रक द्रव्य किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> केंद्रक के अंदर गाढ़ा, अर्धतरल द्रव्य भरा होता है, जिसे केंद्रक द्रव्य कहते हैं। इसमें महीन धागों की जाल जैसी संरचना होती है, जिसे क्रोमैटिन जालिका कहते हैं।
                <br /><b style={{color:"violet"}}>कार्य:</b>
                <ol >
                  <li>केंद्रक कोशिका की रक्षा करता है और कोशिका विभाजन में भाग लेता है।</li>
                  <li>केंद्रक की अनुपस्थिति में कोशिका विभाजन संभव नहीं है।</li>
                  <li>यह कोशिका के विकास और परिपक्वन को नियंत्रित करता है।</li>
                </ol>
              </div>
            ),
          },
          {
            question: "22. गुणसूत्र या क्रोमोसोम क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> यह सामान्य कोशिका के केंद्रक में महीन, लंबे और अत्यधिक कुंडलित धागों के रूप में पाए जाते हैं। 
                <br /> <span style={{color:"blue"}}>क्रोमोसोम के तीन भाग होते हैं:</span>
                <ul >
                  <li>पेलिकल</li>
                  <li>मैट्रिक्स</li>
                  <li>क्रोमैटिड्स</li>
                </ul>
                <p >
                  क्रोमोसोम का सबसे बाहरी आवरण **पेलिकल** कहलाता है। पेलिकल के अंदर का भाग **मैट्रिक्स** कहलाता है। मैट्रिक्स में समांतर कुंडलित धागों जैसी रचनाएँ होती हैं, जिन्हें **क्रोमैटिड्स** कहते हैं।
                </p>
              </div>
            ),
          },
            {
              question: "23. जीवों में क्रोमोसोम की संख्या कितनी है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> मानव शरीर की कोशिकाओं में 46 क्रोमोसोम, मकई के पौधों में 20 क्रोमोसोम, टमाटर के पौधों में 24 क्रोमोसोम, और आलू के पौधों में 48 क्रोमोसोम पाए जाते हैं। ये क्रोमोसोम जोड़े में रहते हैं।
                </div>
              ),
            },
            {
              question: "24. प्रोकैरियोटिक एवं यूकैरियोटिक कोशिका में क्या अंतर है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}> प्रोकैरियोटिक एवं यूकैरियोटिक कोशिकाओं के बीच निम्नलिखित अंतर होते हैं:</span>



                  <table className="table-auto border-collapse text-gray-800 w-full shadow-lg rounded-lg overflow-hidden">
              <thead>
                <tr className="bg-indigo-100">
                  <th className="border border-gray-400 px-6 py-3 text-sky-500 font-medium text-center"><b > प्रोकैरियोटिक</b></th>
                  <th className="border border-gray-400 px-6 py-3 text-sky-500 font-medium text-center "> <b>यूकैरियोटिक </b></th>
                </tr>
              </thead>
              <tbody className="bg-white">
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4 ">(I) आकार: 0.1–5.0 µm</td>
                  <td className="border border-gray-400 px-4 py-4">(I) आकार: 5–100 µm</td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(II) केंद्रिका अनुपस्थित।</td>
                  <td className="border border-gray-400 px-4  py-4">(II) केंद्रिका उपस्थित।</td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(III) सिर्फ एक क्रोमोसोम।</td>
                  <td className="border border-gray-400 px-4  py-4">(III) अनेक क्रोमोसोम। </td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(III) वास्तविक केंद्रक नहीं।</td>
                  <td className="border border-gray-400 px-4  py-4">(III) वास्तविक केंद्रक मौजूद। </td>
                </tr>
              </tbody>
            </table>
                  {/* <b >प्रोकैरियोटिक:</b>
                  <ul >
                    <li>आकार: 0.1–5.0 µm</li>
                    <li>केंद्रिका अनुपस्थित।</li>
                    <li>सिर्फ एक क्रोमोसोम।</li>
                    <li>वास्तविक केंद्रक नहीं।</li>
                  </ul>
                  <b >यूकैरियोटिक:</b>
                  <ul >
                    <li>आकार: 5–100 µm</li>
                    <li>केंद्रिका उपस्थित।</li>
                    <li>अनेक क्रोमोसोम।</li>
                    <li>वास्तविक केंद्रक मौजूद।</li>
                  </ul> */}
                </div>
              ),
            },
            {
              question: "25. पादप कोशिका और जंतु कोशिका में क्या अंतर है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}>पादप कोशिका और जंतु कोशिका में मुख्य अंतर:</span>




                  <table className="table-auto border-collapse text-gray-800 w-full shadow-lg rounded-lg overflow-hidden">
              <thead>
                <tr className="bg-indigo-100">
                  <th className="border border-gray-400 px-6 py-3 text-sky-500 font-medium text-center"><b > पादप कोशिका </b></th>
                  <th className="border border-gray-400 px-6 py-3 text-sky-500 font-medium text-center "> <b>जंतु कोशिका </b></th>
                </tr>
              </thead>
              <tbody className="bg-white">
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4 ">(I) आकार जंतु कोशिका से बड़ा होता है।</td>
                  <td className="border border-gray-400 px-4 py-4">(I) आकार छोटा।</td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(II) मोटी और कड़ी कोशिका भित्ति के कारण नियमित आकार।</td>
                  <td className="border border-gray-400 px-4  py-4">(II) कोशिका का अनियमित आकार।</td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(III) बड़ी रसधानी उपस्थित।</td>
                  <td className="border border-gray-400 px-4  py-4">(III) छोटी या अनुपस्थित रसधानी। </td>
                </tr>
                <tr className="hover:bg-gray-50">
                  <td className="border border-gray-400 px-4  py-4">(III) लवक उपस्थित।</td>
                  <td className="border border-gray-400 px-4  py-4">(III) लवक अनुपस्थित। </td>
                </tr>
              </tbody>
            </table>



{/* 

                  <b >पादप कोशिका:</b>
                  <ul >
                    <li>आकार जंतु कोशिका से बड़ा होता है।</li>
                    <li>मोटी और कड़ी कोशिका भित्ति के कारण नियमित आकार।</li>
                    <li>बड़ी रसधानी उपस्थित।</li>
                    <li>लवक उपस्थित।</li>
                  </ul>
                  <b >जंतु कोशिका:</b>
                  <ul >
                    <li>आकार छोटा।</li>
                    <li>कोशिका का अनियमित आकार।</li>
                    <li>छोटी या अनुपस्थित रसधानी।</li>
                    <li>लवक अनुपस्थित।</li>
                  </ul> */}
                </div>
              ),
            },
            {
              question: "26. पदार्थों का परिवहन किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> पदार्थों को शरीर की कोशिकाओं तक पहुँचाना और हानिकारक पदार्थों को बाहर निकालने की प्रक्रिया को पदार्थों का परिवहन कहते हैं।
                </div>
              ),
            },
            {
              question: "27. विसरण किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> गैस, द्रव, और विलयन के अणुओं की अधिक सांद्रता वाले क्षेत्र से कम सांद्रता वाले क्षेत्र की ओर गति को विसरण कहते हैं।
                </div>
              ),
            },
            {
              question: "28. परासरण किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> जीवित कोशिकाओं में जल के अधिक सांद्रता वाले क्षेत्र से कम सांद्रता वाले क्षेत्र की ओर जल अणुओं की गति को परासरण कहते हैं।
                </div>
              ),
            },
            {
              question: "29. विसरण एवं परासरण के क्या महत्व हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> विसरण और परासरण के महत्व:
                  <ol >
                    <li>विसरण द्वारा O₂ और CO₂ का आदान-प्रदान होता है।</li>
                    <li>वाष्पोत्सर्जन में जलवाष्प का बाहर निकलना विसरण से होता है।</li>
                    <li>कोशिका बाहरी वातावरण से पोषण ग्रहण करती है।</li>
                    <li>परासरण द्वारा पौधे अपने मूल रोम से जल अवशोषित करते हैं।</li>
                  </ol>
                </div>
              ),
            },
            {
              question: "30. निष्क्रिय परिवहन किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> जब पदार्थों के परिवहन में ऊर्जा की आवश्यकता नहीं होती, तो उसे निष्क्रिय परिवहन कहते हैं।
                </div>
              ),
            },
         {
        question: "31. प्रमुख कोशिकीय रचनाएँ और उनके कार्य",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <b >रचनाएँ:</b>
            <ul >
              <li>कोशिका भित्ति</li>
              <li>माइटोकॉण्ड्रिया</li>
              <li>राइबोसोम</li>
              <li>लाइसोसोम</li>
              <li>अवर्णीलवक</li>
              <li>वर्णीलवक</li>
              <li>केंद्रक</li>
            </ul>
            <b >कार्य:</b>
            <ol >
              <li>कोशिका को रूप और सहारा प्रदान करना।</li>
              <li>ऊर्जा निर्माण और कोशिकीय श्वसन।</li>
              <li>प्रोटीन संश्लेषण।</li>
              <li>हाइड्रोलिटिक एंजाइम का भंडार।</li>
              <li>खाद्य संग्रह।</li>
              <li>फूलों और फलों को रंग प्रदान करना।</li>
              <li>कोशिका विभाजन और उपापचयी कार्यों का नियंत्रण।</li>
            </ol>
          </div>
        ),
      },

    ]



const QuestionAnswerPage = () => {
  return (
    <div className="p-4">
      {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
      {/* <Image sr></Image> */}
      <div className='flex justify-between'>
        <div>
      <Image src={"/image/9th-biology-subjective-chapter-1.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image>
      </div>

      {/* <div className='border border-x-8  flex flex-col'>
        <h1>Topics Name</h1>
        <Link href={"#"}>Chapter 2</Link>
        <Link href={"#"}>Chapter 3</Link>
        <Link href={"#"}>Chapter 4</Link>
        <Link href={"#"}>Chapter 5</Link>
        <Link href={"#"}>Chapter 6</Link>
        <Link href={"#"}>Chapter 7</Link>
      </div> */}

      </div>

      {questions.map((faq, index) => (
        <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
          <h3 className="text-xl font-bold text-red-600 mb-2">
            प्रश्‍न: {faq.question}
          </h3>
          <div className="text-xl mt-2">
            {faq.answer}
          </div>
        </div>
      ))}
    </div>
  );
};

export default QuestionAnswerPage;
