
import Image from "next/image";

const questions = [

          {
            question: "1. जीवों में विविधता किस प्रकार से होती है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> जीवों में विभिन्नता रंग, रूप, आकार, आकृति, भोजन, आवास आदि के कारण होती है।
              </div>
            ),
          },
          {
            question: "2. वर्गीकरण किसे कहते है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> जीवों की विविधता के अध्ययन को सहज करने हेतु, हम उनकी समानताओं एवं विषमताओं के आधार पर विभिन्न भागों में बाँटते हैं, जिसे वर्गीकरण कहते हैं।
              </div>
            ),
          },
          {
            question: "3. वर्गीकरण को किसने लिखा?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> कैरोलस लिन्नियस (1707-78) ने अठारहवीं शताब्दी में वर्गिकी की स्थापना की।
              </div>
            ),
          },
          {
            question: "4. वर्गीकरण के कितने इकाइयाँ थी?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> वर्गीकरण की चार इकाइयाँ थीं:
                <ul className="list-disc ml-16">
                  <li>संघ</li>
                  <li>वर्ग</li>
                  <li>वंश</li>
                  <li>जाति</li>
                </ul>
              </div>
            ),
          },
          {
            question: "5. वर्गीकरण की संख्या को किस इकाइयों में बाँटा गया है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> वर्गीकरण को छोटी इकाइयों में बाँटा गया है:
                <ul className="list-disc ml-16">
                  <li>उपसंघ</li>
                  <li>उपवर्ग</li>
                  <li>उपवंश</li>
                  <li>उपजाति</li>
                </ul>
              </div>
            ),
          },
          {
            question: "6. कैरोलस लिन्नियस ने जीवों को कितने भागों में बाँटा है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}> दो भागों में:</span>
                <ul>
                  <li>पादप जगत</li>
                  <li>जंतु जगत</li>
                </ul>
                <p>
                  <b>आधार:</b> पौधे प्रचलन में असमर्थ होते हैं और उनकी कोशिकाओं में
                  क्लोरोफिल एवं कोशिकाभित्ति पाई जाती है। जबकि जंतु प्रचलनशील होते हैं,
                  उनमें क्लोरोफिल अनुपस्थित होता है और उनकी कोशिकाओं में कोशिकाभित्ति
                  नहीं पाई जाती।
                </p>
              </div>
            ),
          },
          {
            question: "7. विकासवाद के संस्थापक कौन थे?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> विकासवाद के संस्थापक चार्ल्स डार्विन ने 1859 में अपनी पुस्तक *द ऑरिजिन ऑफ स्पीशीज* में विकासवाद के सिद्धांत को प्रकाशित किया।
              </div>
            ),
          },
          {
            question: "8. साधारण जीव किसे कहते है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> शुरू में जो जीव धरती पर अवतरित हुए, वे आदिम या पुराने जीव थे, जिन्हें साधारण जीव कहते हैं।
              </div>
            ),
          },
          {
            question: "9. जीवों के वर्गीकरण के कितने स्तर है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}>  जीवों के वर्गीकरण के निम्नलिखित स्तर हैं:</span>
                <ol>
                  <li>जगत (किंगडम)</li>
                  <li>उपजगत (सबकिंगडम)</li>
                  <li>फाइलम या डिवीजन</li>
                  <li>वर्ग (क्लास)</li>
                  <li>गण (ऑर्डर)</li>
                  <li>कुल (फैमिली)</li>
                  <li>वंश (जेनेरा)</li>
                  <li>जाति (स्पीशीज)</li>
                </ol>
              </div>
            ),
          },
          {
            question: "10. हिटेकर के पाँच जगत क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}> हिटेकर के पाँच जगत निम्न हैं:</span>
                <ul>
                  <li>जगत मोनेरा</li>
                  <li>जगत प्रोटिस्टा</li>
                  <li>जगत फंजाई</li>
                  <li>जगत प्लांटी</li>
                  <li>जगत एनिमेलिया</li>
                </ul>
              </div>
            ),
          },
          {
            question: "11. मोनेरा क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> मोनेरा जगत में प्राचीन, सरल और प्रोकैरियोटिक सूक्ष्मजीव सम्मिलित हैं, <br /><b style={{color:"violet"}}> जैसे:-</b>
                <ul>
                  <li>जीवाणु</li>
                  <li>नीलहरित शैवाल</li>
                </ul>
                <p>जीवाणु मुख्यतः एककोशिकीय होते हैं और इनमें कुछ में क्लोरोफिल भी पाया जाता है।</p>
              </div>
            ),
          },
          {
            question: "12. प्रोटिस्टा क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> प्रोटिस्टा जगत में जलीय एककोशिकीय सूक्ष्मजीव होते हैं। ये स्वपोषी और परपोषी होते हैं। 
                <p><b style={{color:"violet"}}>उदाहरण:- </b>अमीबा, पैरामीशियम</p>
              </div>
            ),
          },
          {
            question: "13. फंजाई क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> फंजाई जगत में बहुकोशिकीय यूकैरियोटिक जीव होते हैं, जिनमें क्लोरोफिल नहीं पाया जाता, लेकिन कोशिकाभित्ति होती है।
              </div>
            ),
          },
          {
            question: "14. प्लांटी क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> प्लांटी जगत में यूकैरियोटिक, प्रकाश संश्लेषण करने वाले बहुकोशिकीय जीव होते हैं। इनमें जलीय और स्थलीय दोनों प्रकार के पौधे सम्मिलित हैं।
              </div>
            ),
          },
          {
            question: "15. एनिमेलिया क्या है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> एनिमेलिया जगत में कोशिकाओं में कोशिकाभित्ति नहीं होती। ये जलीय और स्थलीय परपोषी जीव होते हैं।
              </div>
            ),
          },
          {
            question: "16. आइकलर ने पादप जगत को कितने उपजगत में बाँटा?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> आइकलर ने पादप जगत को दो उपजगतों में बाँटा:
                <ul>
                  <li>क्रिप्टोगैम्स</li>
                  <li>फैनरोगैम्स</li>
                </ul>
                <p>
                  <b>क्रिप्टोगैम्स:</b> बीज रहित पौधे, जिनमें जड़ और पत्ती नहीं होती।
                  <br />
                  <b>फैनरोगैम्स:</b> उच्च कोटि के पौधे, जिनमें जड़, तना, पत्ती और संवहन तंत्र होते हैं।
                </p>
              </div>
            ),
          },
          {
            question: "17. क्रिप्टोगैम्स को कितने भागों में बाँटा गया है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> <span style={{color:"blue"}}> क्रिप्टोगैम्स को तीन भागों में बाँटा गया है:</span>
                <ul>
                  <li>थैलोफाइटा</li>
                  <li>ब्रायोफाइटा</li>
                  <li>टेरिडोफाइटा</li>
                </ul>
              </div>
            ),
          },
            {
              question: "18. थैलोफाइटा किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> इनका शरीर जड़, तना एवं पत्तियों में विभाजित नहीं रहता है। यह एक थैलस के रूप में रहता है, इसलिए इन्हें थैलोफाइटा कहते हैं।
                  <ul>
                    <li>इनमें संवहनीय तंत्र नहीं पाया जाता है।</li>
                    <li>शैवाल तथा लाइकेन को इसके अंतर्गत शामिल किया गया है।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "19. शैवाल या ऐल्गी क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> यह पादप जगत का सबसे सरल जलीय जीव है, जो प्रकाश संश्लेषण द्वारा भोजन का निर्माण करता है।
                  <p>
                    कुछ शैवाल एककोशिकीय होते हैं, जबकि अन्य बहुकोशिकीय धागे जैसी संरचना वाले
                    होते हैं, जैसे *स्पाइरोगाइरा*। यह साफ जल में पाए जाते हैं।
                  </p>
                </div>
              ),
            },
            {
              question: "20. लाइकेन क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> लाइकेन पेड़ों की छाल, पत्थरों तथा पुरानी दीवारों पर रंगीन धब्बों के रूप में दिखाई पड़ते हैं।
                  <ul>
                    <li>कवक शैवाल को नमी, खनिज-लवण तथा आश्रय प्रदान करता है।</li>
                    <li>शैवाल भोजन का निर्माण कर कवक को सहयोग देता है।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "21. ब्रोयोफाइटा किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> इस विभाग के पौधे भूमि पर नम एवं छायादार स्थानों पर उगते हैं, इसलिए इन्हें उभरचर कहा जाता है। 
                  <p>अधिकांश पौधे हरे एवं छोटे होते हैं।</p>
                </div>
              ),
            },
            {
              question: "22. टेरिडोफाइटा किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> इस विभाग के पौधों का शरीर जड़, तना और पत्तियों में विभाजित रहता है। 
                  <ul>
                    <li>ये छायादार और नम स्थानों में पाए जाते हैं।</li>
                    <li>इन पौधों में बीज नहीं बनते, इसलिए इन्हें बीजरहित पौधे कहा जाता है।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "23. एनिमेलिया या जंतु जगत की विशेषताओं को लिखें?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b>
                  <ul>
                    <li>ये बहुकोशिकीय होते हैं, जिनकी कोशिका में केंद्रक झिल्ली एवं कोशिकांग पाए जाते हैं।</li>
                    <li>ये परपोषी और विषमपोषी होते हैं, यानी भोजन के लिए अन्य जीवों पर निर्भर रहते हैं।</li>
                    <li>इनके शरीर का आकार निम्न प्रकार का हो सकता है:
                      <ul>
                        <li><b>द्विपार्श्व सममित:</b> शरीर को एक काट द्वारा दो समान भागों में बाँट सकते हैं।</li>
                        <li><b>अरीय सममित:</b> शरीर को केंद्र से कई भागों में बाँटा जा सकता है, जैसे हाइड्रा।</li>
                        <li><b>असममित:</b> शरीर को किसी भी काट द्वारा समान भागों में नहीं बाँटा जा सकता।</li>
                      </ul>
                    </li>
                  </ul>
                </div>
              ),
            },
            {
              question: "24. आर्थोपोडा क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> आर्थोपोडा जंतु जगत का सबसे बड़ा संघ है, जिसमें 75% जंतु शामिल हैं।
                  <ul>
                    <li>ये जल और स्थल के सभी वासस्थानों में पाए जाते हैं।</li>
                    <li>इनका शरीर कठोर निर्जीव बाहरी कंकाल से ढका होता है।</li>
                    <li>देहगुहा में रक्त भरा रहता है।</li>
                    <li>आहार नाल पूर्ण होता है और मुख के चारों ओर मुखांग होते हैं।</li>
                    <li><b style={{color:"violet"}}>उदाहरण:-</b> केकड़ा, झींगा, मक्खी आदि।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "25. मोलस्का क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b>
                  <ul>
                    <li>इनका शरीर अखंडित होता है, लेकिन टॉर्सन प्रक्रिया के कारण असममित हो जाता है।</li>
                    <li>इनका शरीर एक कोमल झिल्ली से ढका होता है, जिसे प्रावार (मेंटल) कहते हैं।</li>
                    <li>देहगुहा छोटी होती है।</li>
                    <li><b style={{color:"violet"}}>उदाहरण:-</b> घोंघा।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "26. प्रोटोकॉर्डेटा किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> इस संघ के जंतुओं में नोटोकार्ड (लचीली छड़ जैसी संरचना) पाई जाती है, जो शरीर के पृष्ठीय तल पर स्थित होती है।
                  <ul>
                    <li>ये द्विपार्श्व सममित और ट्रिप्लोब्लास्टिक होते हैं।</li>
                    <li>इनके शरीर में वास्तविक देहगुहा पाई जाती है।</li>
                    <li><b style={{color:"violet"}}>उदाहरण:-</b> हर्डमानिया, एम्फीओक्सस।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "27. कार्डेटा क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> कार्डेटा जल और स्थल दोनों स्थानों पर पाए जाने वाले जंतु हैं।
                  <ul>
                    <li>इनके शरीर में गुदा के पीछे पुच्छ स्थित होता है।</li>
                  </ul>
                </div>
              ),
            },
              {
                question: "28. मत्स्य या पीसीज क्या है?",
                answer: (
                  <div>
                    <b style={{ color: "green" }}>उत्तर:—</b> यह उपसंघ वर्टिब्रेटा का पहला मारा है।
                    <ul>
                      <li>इसके अंतर्गत मछलियाँ आती हैं, जो मीठे जल में पाई जाती हैं।</li>
                      <li>इनकी त्वचा शल्कों से ढकी होती है।</li>
                      <li>तैरने के लिए पंख और मांसल पूंछ होती है।</li>
                      <li>इसके हृदय में दो कक्ष होते हैं।</li>
                    </ul>
                  </div>
                ),
              },
              {
                question: "29. एम्फिबिया क्या है?",
                answer: (
                  <div>
                    <b style={{ color: "green" }}>उत्तर:—</b> यह जल और स्थल दोनों स्थानों पर निवास करते हैं, इसलिए इसे जलचर या उभयचर कहते हैं।
                    <ul>
                      <li>श्वसन त्वचा, गिल्स, और फेफड़ों द्वारा होता है।</li>
                      <li>अंतः कंकाल अस्थि का बना होता है।</li>
                    </ul>
                  </div>
                ),
              },
              {
                question: "30. रेप्टीलिया क्या है?",
                answer: (
                  <div>
                    <b style={{ color: "green" }}>उत्तर:—</b>
                    <ul>
                      <li>ये जल में या जल के बाहर पाए जाते हैं।</li>
                      <li>ये रेंगकर चलते हैं।</li>
                      <li>श्वसन फेफड़ों द्वारा होता है।</li>
                      <li>उदाहरण: कछुआ, छिपकली।</li>
                    </ul>
                    <p>
                      <b>★ एवीज:</b> इसके अंतर्गत पक्षी आते हैं। इनका शरीर पंखों से ढका रहता है।
                      <ul>
                        <li>जबड़ों में दांत नहीं होते हैं।</li>
                      </ul>
                    </p>
                  </div>
                ),
              },
              {
                question: "31. स्तनी या मैमेलिया क्या है?",
                answer: (
                  <div>
                    <b style={{ color: "green" }}>उत्तर:—</b> ये नियततापी होते हैं।
                    <ul>
                      <li>इनकी त्वचा बाल या रोम से ढकी होती है।</li>
                      <li>श्वसन फेफड़ों द्वारा होता है।</li>
                      <li><b style={{color:"violet"}}>उदाहरण:-</b> बतख, चूहा, कुत्ता इत्यादि।</li>
                    </ul>
                  </div>
                ),
              },
            ]



            const QuestionAnswerPage = () => {
              return (
                <div className="p-4">
                  {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
                  {/* <Image sr></Image> */}
                  <div className='flex justify-between'>
                    <div>
                  {/* <Image src={"/image/8th-S-Chap-1.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image> */}
                  </div>
            
                  {/* <div className='border border-x-8  flex flex-col'>
                    <h1>Topics Name</h1>
                    <Link href={"#"}>Chapter 2</Link>
                    <Link href={"#"}>Chapter 3</Link>
                    <Link href={"#"}>Chapter 4</Link>
                    <Link href={"#"}>Chapter 5</Link>
                    <Link href={"#"}>Chapter 6</Link>
                    <Link href={"#"}>Chapter 7</Link>
                  </div> */}
            
                  </div>
            
                  {questions.map((faq, index) => (
                    <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
                      <h3 className="text-xl font-bold text-red-600 mb-2">
                        प्रश्‍न: {faq.question}
                      </h3>
                      <div className="text-xl mt-2">
                        {faq.answer}
                      </div>
                    </div>
                  ))}
                </div>
              );
            };
            
            export default QuestionAnswerPage;
            
                    