import Image from "next/image";

const questions = [
    {
      question: "1. कैथोड किरण और इलेक्ट्रॉन का आविष्कार?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>
            कॉच की एक विसर्ग नली में कोई गैस लेते है और विद्युत–धारा प्रवाहित करने पर कैथोड से एक किरण निकालकर एनोड की ओर गमन करती है इसे कैथोड किरण कहते हैं।
          </p>
        </div>
      ),
    },
    {
      question: "2. कैथोड किरण के गुण को लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <ol>
            <li>कैथोड किरण सीधे रेखा में गमन करती है।</li>
            <li>कॉच के विसर्ग नली में कोई वस्तु को रखने पर वस्तु की छाया कैथोड के दूसरे तरफ बनती है।</li>
            <li>कॉच के विसर्ग नली में कोई चक्र रखने पर चक्र अपने घूरी पर नाचने लगती है।</li>
            <li>कॉच के विसर्ग नली में चुंबकीय क्षेत्र लगाने से कैथोड किरण अपने दिशा से विचलित हो जाते है।</li>
          </ol>
        </div>
      ),
    },
    {
      question: "3. एनोड किरण किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>
            कॉच की एक विसर्ग नली में हाइड्रोजन गैस लेते हैं , और विद्युत धारा प्रवाहित करने पर एनोड से एक किरण निकलकर कैथोड की ओर गमन करती है एनोड की किरण को प्रोटॉन कहते हैं।
          </p>
        </div>
      ),
    },
    {
      question: "4. एनोड किरण के गुण को लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <ol>
            <li>एनोड किरण सीधी रेखा में कैथोड की ओर गमन करती है।</li>
            <li>कॉच के विसर्ग नली में चुंबकीय क्षेत्र लगाने पर एनोड किरण अपने दिशा से विचलित हो जाते हैं।</li>
            <li>एनोड किरण को प्रोटॉन कहते हैं और प्रोटोन को p+ लिखा जाता है।</li>
          </ol>
        </div>
      ),
    },
    {
      question: "5. इलेक्ट्रॉन की विशेषताएँ?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>आवेश और द्रव्यमान।</p>
          <b>आवेश:</b> इलेक्ट्रॉन पर ऋण आवेश कण होता है। इलेक्ट्रॉन के आवेश का मान e⁻ = 1.60× 10⁻¹⁹ C
          <br />
          <b>द्रव्यमान:</b> इलेक्ट्रॉन में द्रव्यमान होता है जिसे g या kg में लिखा जाता है। e⁻ = 9.1×10⁻³¹ kg
        </div>
      ),
    },
    {
      question: "6. न्यूट्रॉन का आविष्कार किसने किया?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>
            जेम्स चैडविक ने न्यूट्रॉन का आविष्कार किया। जेम्स चैडविक ने 1932 में बेरिलियम धातु पर अल्फा कणों के प्रभाव के अध्ययन के दौरान न्यूट्रॉन की खोज की।
          </p>
        </div>
      ),
    },
    {
      question: "7. इलेक्ट्रॉन, प्रोटॉन और न्यूट्रॉन में अंतर लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>इलेक्ट्रॉन, प्रोटॉन और न्यूट्रॉन में निम्न अंतर है:</p>
          <b>इलेक्ट्रॉन:</b>
          <ol>
            <li>इलेक्ट्रॉन का संकेत e⁻ है।</li>
            <li>इलेक्ट्रॉन का आवेश -1.602 × 10⁻¹⁹ कूलॉम है।</li>
            <li>इलेक्ट्रॉन का द्रव्यमान लगभग 9.109 × 10⁻³¹ किलोग्राम है।</li>
            <li>इलेक्ट्रॉन परमाणु के बाहरी भाग में पाए जाते हैं और इलेक्ट्रॉन त्वचा बनाते हैं।</li>
          </ol>
          <b>प्रोटॉन:</b>
          <ol>
            <li>प्रोटॉन का संकेत p+ या H+ है।</li>
            <li>प्रोटॉन का आवेश +1.602 × 10⁻¹⁹ कूलॉम है।</li>
            <li>प्रोटॉन का द्रव्यमान लगभग 1.672 × 10⁻²⁷ किलोग्राम है।</li>
            <li>प्रोटॉन परमाणु के नाभिक में पाए जाते हैं।</li>
          </ol>
          <b>न्यूट्रॉन:</b>
          <ol>
            <li>न्यूट्रॉन का संकेत n या n⁰ है।</li>
            <li>न्यूट्रॉन का आवेश शून्य है।</li>
            <li>न्यूट्रॉन का द्रव्यमान लगभग 1.675 × 10⁻²⁷ किलोग्राम है।</li>
            <li>न्यूट्रॉन परमाणु के नाभिक में पाए जाते हैं।</li>
          </ol>
        </div>
      ),
    },
    {
      question: "8. थॉमसन का परमाणु मॉडल?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>
            सर्वप्रथम थॉमसन ने परमाणु का एक मॉडल दिया जो तरबूज की तरह था इसके अनुसार परमाणु में धन आवेश कण तरबूज का खानेवाला लाल भाग होता है। और इलेक्ट्रॉन तरबूज के बीच के तरह धँसे रहते है।
          </p>
          <p><b>नोट:— थॉमसन के अनुसार</b></p>
          <ol>
            <li>परमाणु एक धन आवेशित गोलाकार पिंड होता है और इलेक्ट्रॉन इसमें धँसे रहते हैं।</li>
            <li>परमाणु में धन आवेशित कण और ऋण आवेशित कण की संख्या बराबर होते हैं इसलिए परमाणु उदासीन होते हैं।</li>
          </ol>
        </div>
      ),
    },
    {
      question: "9. रदरफोर्ड का परमाणु मॉडल?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b>
          <p>
            रदरफोर्ड ने अल्फा (α) कण को सोने के ऊपर प्रवाहित किया जिससे अल्फा (α) कण सीधे रेखा में चले गए और कुछ अल्फा (α) कण अपने दिशा से विचलित हो गए।
          </p>
          <p><b>नोट:— रदरफोर्ड के अनुसार</b></p>
          <ol>
            <li>रदरफोर्ड के अनुसार परमाणु में रिक्त स्थान होते हैं जिसके कारण अल्फा (α) कण सीधे रेखा में निकल जाते हैं।</li>
            <li>कुछ अल्फा (α) कण अपने दिशा से विचलित हो जाते हैं जिससे ये पता चलता है कि परमाणु धन आवेशित कण उपस्थित है।</li>
            <li>बहुत कम अल्फा (α) कण टकराने के बाद अपने दिशा में वापस आते हैं परमाणु में धन आवेशित कण मध्य स्थान में उपस्थित है।</li>
            <li>परमाणु का कुल द्रव्यमान उसके नाभिक में उपस्थित है।</li>
            <li>परमाणु में ऋण आवेशित इलेक्ट्रॉन और धन आवेशित प्रोटॉन की संख्या समान होते हैं इसलिए परमाणु उदासीन होते हैं।</li>
            <li>इलेक्ट्रॉन नाभिक के चारों ओर चक्कर लगाते हैं जिसे सेल कहते हैं।</li>
          </ol>
        </div>
      ),
    },
      {
        question: "10. रदरफोर्ड परमाणु मॉडल में कमी?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <p>
              रदरफोर्ड के अनुसार इलेक्ट्रॉन नाभिक के चारों ओर चक्कर लगाते हैं क्योंकि इस प्रकार परमाणु स्थायी नहीं हो सकता विद्युत चुंबकीय सिद्धांत के अनुसार चक्कर लगाने वाले इलेक्ट्रॉन से ऊर्जा का हॉर्स होता रहेगा जिसके कारण नाभिक का आकर्षण बल अधिक हो जाता है और इलेक्ट्रॉन नाभिक में गिर जाते है।
            </p>
          </div>
        ),
      },
      {
        question: "11. बोर का परमाणु मॉडल?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <p>
              रदरफोर्ड परमाणु मॉडल के कमी को दूर करने के लिए बोर ने परमाणु का एक मॉडल दिया।
            </p>
            <p><b>नोट:– बोर के परमाणु मॉडल के अनुसार</b></p>
            <ol>
              <li>परमाणु में इलेक्ट्रॉन नाभिक के चारों ओर कुछ निश्‍चित ऊर्जा के साथ घूमते रहते हैं।</li>
              <li>जब इलेक्ट्रॉन नाभिक के चारों ओर चक्कर लगाते हैं तो इलेक्ट्रॉन का ऊर्जा का हॉर्स नहीं होता है।</li>
              <li>जिसमें इलेक्ट्रॉन घूमते हैं उसे कक्षा या सेल कहते हैं।</li>
            </ol>
          </div>
        ),
      },
      {
        question: "12. विभिन्न कक्षाओं में इलेक्ट्रॉन का वितरण?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <p>किसी कक्षा में इलेक्ट्रॉन का अधिकतम संख्या का सूत्र 2n² है:</p>
            <ol>
              <li>
                <b>n = 1</b> <br />
                K = 2n² = 2×(1)² = 2×1 = 2
              </li>
              <li>
                <b>n = 2</b> <br />
                L = 2n² = 2×(2)² = 2×4 = 8
              </li>
              <li>
                <b>n = 3</b> <br />
                M = 2n² = 2×(3)² = 2×9 = 18
              </li>
              <li>
                <b>n = 4</b> <br />
                N = 2n² = 2×(4)² = 2×16 = 32
              </li>
            </ol>
            <p>K(2), L(8), M(18), N(32)</p>
          </div>
        ),
      },
      {
        question: "13. तत्वों का इलेक्ट्रॉनिक विन्यास लिखें?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <table border="1" style={{ width: "100%" }}>
              <thead>
                <tr>
                  <th>तत्व</th>
                  <th>परमाणु क्रमांक</th>
                  <th>इलेक्ट्रॉनिक विन्यास</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>H</td>
                  <td>1</td>
                  <td>1s¹</td>
                </tr>
                <tr>
                  <td>C</td>
                  <td>6</td>
                  <td>1s² 2s² 2p²</td>
                </tr>
                <tr>
                  <td>O</td>
                  <td>8</td>
                  <td>1s² 2s² 2p⁴</td>
                </tr>
                <tr>
                  <td>Ne</td>
                  <td>10</td>
                  <td>1s² 2s² 2p⁶</td>
                </tr>
                <tr>
                  <td>Mg</td>
                  <td>12</td>
                  <td>1s² 2s² 2p⁶ 3s²</td>
                </tr>
                <tr>
                  <td>Al</td>
                  <td>13</td>
                  <td>1s² 2s² 2p⁶ 3s² 3p¹</td>
                </tr>
                <tr>
                  <td>Si</td>
                  <td>14</td>
                  <td>1s² 2s² 2p⁶ 3s² 3p²</td>
                </tr>
                <tr>
                  <td>P</td>
                  <td>15</td>
                  <td>1s² 2s² 2p⁶ 3s² 3p³</td>
                </tr>
                <tr>
                  <td>S</td>
                  <td>16</td>
                  <td>1s² 2s² 2p⁶ 3s² 3p⁴</td>
                </tr>
                <tr>
                  <td>Cl</td>
                  <td>17</td>
                  <td>1s² 2s² 2p⁶ 3s² 3p⁵</td>
                </tr>
              </tbody>
            </table>
          </div>
        ),
      },
      {
        question: "14. परमाणु संख्या किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <p>
              परमाणु के नाभिक में उपस्थित प्रोटॉन की संख्या को परमाणु संख्या कहते हैं। 
              <br />
              <b>परमाणु संख्या को z से लिखा जाता है।</b>
              <br />
              जैसे:— नाइट्रोजन में प्रोटॉन की संख्या 7 होता है।
            </p>
            <p><b>द्रव्यमान संख्या:—</b> परमाणु के नाभिक में उपस्थित प्रोटॉन और न्यूट्रॉन की संख्या का योगफल परमाणु द्रव्यमान कहलाता है।</p>
            <p>A = Z + N</p>
            <p>A → द्रव्यमान संख्या</p>
            <p>Z → परमाणु संख्या</p>
            <p>N → न्यूट्रॉनों की संख्या</p>
            <p><b>उदाहरण:</b><br />
            ¹¹Na²³ → सोडियम <br />
            परमाणु संख्या (Z) = 11 <br />
            द्रव्यमान संख्या (A) = 23 <br />
            न्यूट्रॉनों की संख्या (n) = ?
            </p>
            <p>
              हम जानते हैं कि: <br />
              द्रव्यमान संख्या (A) = प्रोटॉनों की संख्या (Z) + न्यूट्रॉनों की संख्या (n)
            </p>
            <p>A = Z + n <br />
            23 = 11 + n <br />
            n = 23 - 11 <br />
            n = 12
            </p>
            <p>अतः, सोडियम परमाणु में 12 न्यूट्रॉन होते हैं।</p>
          </div>
        ),
      },
      {
        question: "15. कुछ सामान्य तत्वों की जानकारी?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <table border="1" style={{ width: "100%" }}>
              <thead>
                <tr>
                  <th>तत्व</th>
                  <th>परमाणु संख्या (Z)</th>
                  <th>द्रव्यमान संख्या (A)</th>
                  <th>न्यूट्रॉन की संख्या (A-Z)</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>H</td>
                  <td>1</td>
                  <td>1</td>
                  <td>1-1=0</td>
                </tr>
                <tr>
                  <td>He</td>
                  <td>2</td>
                  <td>4</td>
                  <td>4-2=2</td>
                </tr>
                <tr>
                  <td>Li</td>
                  <td>3</td>
                  <td>7</td>
                  <td>7-3=4</td>
                </tr>
                <tr>
                  <td>Be</td>
                  <td>4</td>
                  <td>9</td>
                  <td>9-4=5</td>
                </tr>
                <tr>
                  <td>B</td>
                  <td>5</td>
                  <td>11</td>
                  <td>11-5=6</td>
                </tr>
                <tr>
                  <td>C</td>
                  <td>6</td>
                  <td>12</td>
                  <td>12-6=6</td>
                </tr>
                <tr>
                  <td>N</td>
                  <td>7</td>
                  <td>14</td>
                  <td>14-7=7</td>
                </tr>
                <tr>
                  <td>O</td>
                  <td>8</td>
                  <td>16</td>
                  <td>16-8=8</td>
                </tr>
                <tr>
                  <td>F</td>
                  <td>9</td>
                  <td>19</td>
                  <td>19-9=10</td>
                </tr>
                <tr>
                  <td>Ne</td>
                  <td>10</td>
                  <td>20</td>
                  <td>20-10=10</td>
                </tr>
                <tr>
                  <td>Na</td>
                  <td>11</td>
                  <td>23</td>
                  <td>23-11=12</td>
                </tr>
                <tr>
                  <td>Mg</td>
                  <td>12</td>
                  <td>24</td>
                  <td>24-12=12</td>
                </tr>
              </tbody>
            </table>
          </div>
        ),
      },
      {
        question: "16. एक तत्व की परमाणु संख्या 12 है तो तत्व में प्रोटॉन और इलेक्ट्रॉन की संख्या बताइए?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b>
            <p>Z = 12</p>
            <p>
              हम जानते हैं कि प्रोटॉन और इलेक्ट्रॉन की संख्या बराबर होती है। 
              <br />
              इसीलिए प्रोटॉन की संख्या=12 और इलेक्ट्रॉन की संख्या=12
            </p>
          </div>
        ),
      },
        {
          question: "17. किसी तत्व के परमाणु में 11 प्रोटॉन और 12 न्यूट्रॉन है तो तत्व में परमाणु संख्या , द्रव्यमान संख्या और इलेक्ट्रॉन की संख्या निकले?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                p+ = 11<br />
                n = 12<br />
                द्रव्यमान A = z+n<br />
                A = 11+22<br />
                A = 33<br />
                परमाणु संख्या z = 11<br />
                इलेक्ट्रॉन की संख्या e⁻ = 11
              </p>
            </div>
          ),
        },
        {
          question: "18. किसी तत्व का द्रव्यमान संख्या 24 और परमाणु संख्या 12 है तो तत्व में न्यूट्रॉन की संख्या बताइए?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                A = 24<br />
                Z = 12<br />
                A = z + n<br />
                24 = 12 + n<br />
                24–12 = n<br />
                12 = n<br />
                अतः न्यूट्रॉन की संख्या = 12
              </p>
            </div>
          ),
        },
        {
          question: "19. समस्थानिक तत्व किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                एक ही तत्व के परमाणु संख्या समान हो और द्रव्यमान संख्या अलग-अलग हो उसे समस्थानिक तत्व कहते हैं।
              </p>
              <p>
                जैसे:— <br />
                (i) क्लोरीन के दो समस्थानिक तत्व होते हैं जिसमें क्लोरीन की परमाणु संख्या समान होते हैं लेकिन दोनों क्लोरीन में द्रव्यमान संख्या 35 और 37 होते हैं। <br />
                (ii) हाइड्रोजन के तीन समस्थानिक होते हैं जिसकी परमाणु संख्या 1 है और द्रव्यमान संख्या 1, 2, 3 होते हैं। <br />
                (iii) कार्बन के दो समस्थानिक होते हैं जिसकी परमाणु संख्या 6 होते हैं और द्रव्यमान संख्या 12 और 14 होते हैं।
              </p>
            </div>
          ),
        },
        {
          question: "20. समस्थानिक तत्व के गुण को लिखें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                समस्थानिक तत्व के गुण निम्न है:
              </p>
              <ol>
                <li>किसी तत्व के सभी समस्थानिक में इलेक्ट्रॉन की संख्या समान होते हैं लेकिन परमाणु द्रव्यमान अलग-अलग होते हैं।</li>
                <li>किसी तत्व के समस्थानिक के भौतिक गुण अलग-अलग होते हैं इसका कारण समस्थानिक में न्यूट्रॉन की संख्या समान नहीं होते हैं।</li>
              </ol>
            </div>
          ),
        },
        {
          question: "21. समस्थानिक तत्व के उपयोग को लिखें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                समस्थानिक तत्व के उपयोग निम्न है:
              </p>
              <ol>
                <li>यूरेनियम एक समस्थानिक तत्व है इसका उपयोग परमाणु भट्टी में ईंधन के रूप में होता है।</li>
                <li>कैंसर के उपचार में कोबाल्ट के समस्थानिक का उपयोग होता है।</li>
                <li>घेघा रोग के इलाज में आयोडीन के समस्थानिक का उपयोग होता है।</li>
                <li>कार्बन के समस्थानिक का उपयोग जीवाश्म का उम्र जानने के लिए किया जाता है।</li>
              </ol>
            </div>
          ),
        },
        {
          question: "22. समभारिक तत्व किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                वैसे तत्व जिसमें द्रव्यमान संख्या समान हो और परमाणु संख्या अलग-अलग हो उसे समभारिक तत्व कहते हैं।
              </p>
              <p>
                जैसे:— <br />
                Ar, K, Ca <br />
                द्रव्यमान संख्या: 40, 40, 40 <br />
                परमाणु संख्या: 18, 19, 20
              </p>
            </div>
          ),
        },
        {
          question: "23. सम न्यूट्रॉनिक तत्व किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                वैसे तत्व जिसमें न्यूट्रॉन की संख्या समान हो लेकिन परमाणु संख्या और द्रव्यमान संख्या अलग-अलग हो उसे सम न्यूट्रॉनिक तत्व कहते हैं।
              </p>
              <p>
                तत्व: C, N, O <br />
                द्रव्यमान संख्या: 14, 15, 16 <br />
                परमाणु संख्या: 6, 7, 8 <br />
                न्यूट्रॉन की संख्या: 8, 8, 8
              </p>
            </div>
          ),
        },
        {
          question: "24. संयोजकता किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                किसी तत्व का संयोजकता उसके अंतिम इलेक्ट्रॉन पर निर्भर करता है।
              </p>
              <ol>
                <li>किसी तत्व का संयोजकता 1 से लेकर 7 तक हो सकता है।</li>
                <li>किसी तत्व का अंतिम इलेक्ट्रॉन 1, 2, 3 और 4 हो तो उस तत्व का संयोजकता वही होगा।</li>
                <li>किसी तत्व का अंतिम इलेक्ट्रॉन 4 से अधिक हो तो उस तत्व का संयोजकता 4 और 8 का अंतर देखना है।</li>
                <li>अभिक्रिया गैस का संयोजकता 8 होता है।</li>
              </ol>
            </div>
          ),
        },
        {
          question: "25. अयान का निर्माण किसे कहते है?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                जब परमाणु पर धन आवेश या ऋण आवेश उपस्थित हो उसे आयन कहते हैं।
              </p>
            </div>
          ),
        },
        {
          question: "26. धन आवेश (+) किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                जब कोई परमाणु इलेक्ट्रॉन का त्याग करता है तो उस परमाणु पर धन आवेश (+) आता है।
              </p>
            </div>
          ),
        },
        {
          question: "27. ऋण आवेश (–) किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <p>
                जब कोई परमाणु इलेक्ट्रॉन का ग्रहण करता है तो उस परमाणु पर ऋण आवेश आता है।
              </p>
              <p>
                नोट:— जब किसी परमाणु का संयोजकता 1, 2, 3 और 4 हो तो उस परमाणु पर धन आवेश आएगा।
              </p>
              <p>
                (i) सोडियम (Na):<br />
                इलेक्ट्रॉनिक विन्यास: 2, 8, 1<br />
                संयोजकता = 1<br />
                आयन: Na⁺ (सोडियम आयन)<br />
                (ii) मैग्नीशियम (Mg):<br />
                इलेक्ट्रॉनिक विन्यास: 2, 8, 2<br />
                संयोजकता = 2<br />
                आयन: Mg²⁺ (मैग्नीशियम आयन)<br />
                (iii) एल्युमिनियम (Al):<br />
                इलेक्ट्रॉनिक विन्यास: 2, 8, 3<br />
                संयोजकता = 3<br />
                आयन: Al³⁺ (एल्युमिनियम आयन)<br />
                (iv) ऑक्सीजन (O):<br />
                इलेक्ट्रॉनिक विन्यास: 2, 6<br />
                संयोजकता = 8–6 = 2<br />
                आयन: O²⁻ (ऑक्साइड आयन)
              </p>
            </div>
          ),
        },
        {
          question: "28. तत्वों का संयोजकता ज्ञात करें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              <table border="1" style={{ width: "100%" }}>
                <thead>
                  <tr>
                    <th>तत्व</th>
                    <th>संयोजकता</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td>Na (सोडियम)</td>
                    <td>1</td>
                  </tr>
                  <tr>
                    <td>Mg (मैग्नीशियम)</td>
                    <td>2</td>
                  </tr>
                  <tr>
                    <td>O (ऑक्सीजन)</td>
                    <td>2</td>
                  </tr>
                  <tr>
                    <td>F (फ्लोरीन)</td>
                    <td>1</td>
                  </tr>
                  <tr>
                    <td>N (नाइट्रोजन)</td>
                    <td>3</td>
                  </tr>
                  <tr>
                    <td>Cl (क्लोरीन)</td>
                    <td>1</td>
                  </tr>
                  <tr>
                    <td>K (पोटेशियम)</td>
                    <td>1</td>
                  </tr>
                  <tr>
                    <td>Si (सिलिकॉन)</td>
                    <td>4</td>
                  </tr>
                  <tr>
                    <td>S (सल्फर)</td>
                    <td>2</td>
                  </tr>
                  <tr>
                    <td>Ne (नियॉन)</td>
                    <td>0</td>
                  </tr>
                </tbody>
              </table>
            </div>
          ),
        },
        
    
    
      
      

         
         
         
         

            ]



              const QuestionAnswerPage = () => {
                return (
                  <div className="p-4">
                    {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
                    {/* <Image sr></Image> */}
                    <div className='flex justify-between'>
                      <div>
                    {/* <Image src={"/image/8th-S-Chap-1.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image> */}
                    </div>
              
                    {/* <div className='border border-x-8  flex flex-col'>
                      <h1>Topics Name</h1>
                      <Link href={"#"}>Chapter 2</Link>
                      <Link href={"#"}>Chapter 3</Link>
                      <Link href={"#"}>Chapter 4</Link>
                      <Link href={"#"}>Chapter 5</Link>
                      <Link href={"#"}>Chapter 6</Link>
                      <Link href={"#"}>Chapter 7</Link>
                    </div> */}
              
                    </div>
              
                    {questions.map((faq, index) => (
                      <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
                        <h3 className="text-xl font-bold text-red-600 mb-2">
                          प्रश्‍न: {faq.question}
                        </h3>
                        <div className="text-xl mt-2">
                          {faq.answer}
                        </div>
                      </div>
                    ))}
                  </div>
                );
              };
              
              export default QuestionAnswerPage;
              
