

import Image from 'next/image';
import Link from 'next/link';
import React from 'react';

const questions = [


  
//     // chapter 6 दहन एवं ज्वाला

//     {
//       chapterName: "दहन एवं ज्वाला",
//       imageUrl: "/image/8th-S-Chap-6.png", // 🖼️ Image for this chapter
//       description: (
//         <h1><b style={{ color: "blue" }}> इस अध्याय में ह उर्वरक।</b></h1>

//       ),
//       questions: [

         {
           question: " 1. दहन किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> वह रासायनिक प्रक्रम जिसमें कोई पदार्थ ऑक्सीजन से अभिक्रिया कर ऊष्मा देता है, दहन कहलाता है।
             </div>
           ),
         },
         {
           question: " 2. ईंधन किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> ईंधन वे पदार्थ हैं जो जलने पर ऊर्जा प्रदान करते हैं।
             </div>
           ),
         },
         {
           question: " 3. ज्वाला किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> ज्वाला जलने की प्रक्रिया में उत्पन्न होने वाली ऊर्जा के रूप में दिखाई देने वाली लौ को ज्वाला कहते हैं।
             </div>
           ),
         },
         {
           question: " 4. ज्वलन ताप क्या है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> वह न्यूनतम ताप जिस पर कोई पदार्थ जलने लगता है, वह ताप उस पदार्थ का ज्वलन ताप कहलाता है।
             </div>
           ),
         },
         {
           question: " 5. सूर्य में ऊष्मा और प्रकाश किस अभिक्रिया द्वारा उत्पन्न होते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> नाभिकीय संलयन अभिक्रिया के द्वारा।
             </div>
           ),
         },
         {
           question: " 6. स्वत: दहन किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जो पदार्थ बिना गर्म किया स्वत: ही जल उठता है, स्वत: दहन कहलाता है।
               <br />
               <p className="ml-14">
                 <b style={{ color: "violet" }}>उदाहरण:—</b> पीले फॉस्फोरस का ज्वलन ताप कमरे के तापमान से कम होने के कारण यह स्वतः ही जल उठता है। क्योंकि इसका ज्वलन ताप कमरे के तापमान से कम होता है।
               </p>
             </div>
           ),
         },
         {
           question: " 7. ग्लोबल वार्मिंग का मुख्य कारण क्या है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> ग्रीनहाउस गैसों का उत्सर्जन, विशेष रूप से कार्बन डाइऑक्साइड (CO₂) ग्लोबल वार्मिंग का मुख्य कारण है।
             </div>
           ),
         },
         {
           question: " 8. इंधनों के अपूर्ण दहन से कौन–सा विषैला गैस बनता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> ईंधनों के अपूर्ण दहन से कार्बन मोनोऑक्साइड (CO) विषैला गैस बनता है।
             </div>
           ),
         },
         {
           question: " 9. अम्लीय वर्षा का मुख्य कारण क्या है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> सल्फर और नाइट्रोजन के ऑक्साइड अम्लीय वर्षा का मुख्य कारण है।
             </div>
           ),
         },
         {
           question: " 10. कागज के कप में पानी को उबालने पर कागज जलता नहीं क्यों?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कागज़ के कप में पानी को उबालने पर कागज़ जलता नहीं है, क्योंकि जल के कारण कागज़ का तापमान उसके ज्वलन तापमान से कम रहता है।
             </div>
           ),
         },
         {
           question: " 11. जलने के तीन उपयोगी बात लिखिए?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b> <b style={{ color: "blue" }}>जलने के तीन उपयोगी बात हैं:</b>
               </p>
               <ol className="ml-16">
                 <li>(i) ज्वलनशील पदार्थ।</li>
                 <li>(ii) ज्वलन ताप।</li>
                 <li>(iii) ऑक्सीजन।</li>
               </ol>
             </div>
           ),
         },
         {
           question: " 12. दहन कितने प्रकार के होते हैं?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b> <b style={{ color: "blue" }}> दहन तीन प्रकार के होते हैं: </b>
               </p>
               <ol className="ml-16">
                 <li>(i) तीव्र दहन ।</li>
                 <li>(ii) स्वतः दहन।</li>
                 <li>(iii) विस्फोटक।</li>
               </ol>
             </div>
           ),
         },
         {
           question: " 13. आग पर तुरंत काबू कैसे पाया जा सकता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> आग पर तुरंत काबू पाने के लिए ऑक्सीजन संपर्क को काट दिया जाता है, इसके लिए कई प्रचलित विधियाँ हैं।

               <p className="ml-16">
                 <b style={{ color: "violet" }}> जैसे:— </b>  पानी डालना, कार्बन डाइऑक्साइड का छिड़काव करना, इसे ज्वलन ताप भी तुरंत कम हो जाता है।
               </p>
             </div>
           ),
         },
         {
           question: " 14. कार्बन–डाइऑक्साइड (CO₂) कैसे एक अच्छा अग्निशमक है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कार्बन-डाइऑक्साइड (CO₂) एक अच्छा अग्निशमक है, क्योंकि यह आग को हवा से दूर रखता है और आग के तापमान को कम करता है, जिससे आग जल्दी बुझ जाती है।
             </div>
           ),
         },
         {
           question: " 15. अम्लीय वर्षा के क्या हानिकारक प्रभाव है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> ये फसलों को नष्ट कर देती है, मृदा को अम्लीय बनाती है। अम्लीय वर्षा का पानी नदी या तालाब में मिल जाए तो जीव नष्ट हो सकते हैं।
             </div>
           ),
         },
         {
           question: " 16. कोयले को हवा की अनुपस्थिति में गर्म करने से क्या प्राप्त होता है?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b>  <b style={{ color: "blue" }}>कोयले को हवा की अनुपस्थिति में गर्म करने से हमें निम्नलिखित महत्वपूर्ण पदार्थ प्राप्त होते हैं: </b>
               </p>
               <ol className="ml-16">
                 <li>(i) कृत्रिम पेट्रोलियम।</li>
                 <li>(ii) बेंजीन।</li>
                 <li>(iii) औषधियाँ।</li>
                 <li>(iv) विस्फोटक पदार्थ।</li>
                 <li>(v) ईंधन गैस।</li>
                 <li>(vi) कोक।</li>
               </ol>
             </div>
           ),
         },
         {
           question: " 17. अम्लीय वर्षा किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> सल्फर और नाइट्रोजन के ऑक्साइड वर्षा जल में घुल जाते हैं तथा अम्ल बनाते हैं, ऐसी वर्षा अम्लीय वर्षा कहलाती है।
             </div>
           ),
         },
         {
           question: " 18. ज्वाला के तीन भिन्न क्षेत्र कौन-कौन से हैं?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b><b style={{ color: "blue" }}>  ज्वाला के तीन भिन्न क्षेत्र निम्न हैं: </b>
               </p>
               <ol className="ml-16">
                 <li> (i) अदीप्त क्षेत्र। </li>
                 <li> (ii) दीप्त क्षेत्र। </li>
                 <li>(iii) ज्योतिहिन क्षेत्र।</li>
               </ol>
             </div>
           ),
         },
         {
           question: " 19. विद्युत उपकरणों में लगी आग को बुझाने के लिए कार्बन डाइऑक्साइड के छिड़काव के क्या लाभ है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कार्बन डाइऑक्साइड से विद्युत उपकरणों को कोई हानि नहीं पहुँचती जबकि पानी डालने पर जल विद्युत का चालन कर सकता है।
             </div>
           ),
         },
         {
           question: " 20. आग लगने पर उसे कई बार पानी डालकर बुझाते हैं। पानी डालने से आग कैसे बुझ जाती है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> आग को बुझाने के लिए साधारणतया जल का प्रयोग किया जाता है क्योंकि जल ज्वलनशील पदार्थ को ठंडा करता है और आग का फैलाव बंद हो जाता है। इस प्रक्रिया में जो जलवाष्प बनती है वह बाहर के वातावरण से वायु की आपूर्ति बंद कर देती है और आग बुझ जाती है।
             </div>
           ),
         },
         {
           question: " 21. अज्वलनशील पदार्थ किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जो पदार्थ लौ पर गर्म करने पर नहीं जलते हैं, अज्वलनशील पदार्थ कहलाते हैं।
               <p className="ml-16">
                 <b style={{ color: "violet" }}>  जैसे:—  </b>पत्थर, धातु, पानी आदि।
               </p>
             </div>
           ),
         },
         {
           question: " 22. माचिस को जलाने के लिए उसे माचिस की डिब्बा से रगड़ा जाता है। ऐसा क्यों?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> हमारे घरों में जो माचिस की डिबियाँ उपयोग में लायी जाती हैं उनके तीलियों पर रसायन पोटैशियम क्लोरेट होता है। डिब्बी पर लाल फास्फोरस और सल्फर लगा होता है। जब हम तीलियों को डिब्बी पर रगड़ते हैं तो यह जल उठती है।
             </div>
           ),
         },
         {
           question: " 23. दहन और जंग लगने में क्या अंतर है?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b> <b style={{ color: "blue" }}> दहन और जंग लगने में मुख्य अंतर यह है:</b>
               </p>
               <ol className="ml-16">
                 <li>
                   <b style={{ color: "violet" }}>(I) दहन:</b> दहन एक रासायनिक प्रतिक्रिया है जिसमें कोई पदार्थ ऑक्सीजन की उपस्थिति में जलता है और ऊर्जा का उत्पादन करता है। इसमें ताप और प्रकाश का उत्पादन होता है।
                 </li>
                 <li>
                   <b style={{ color: "violet" }}>(II) जंग लगना:</b> जंग लगना एक रासायनिक प्रतिक्रिया है जिसमें धातु ऑक्सीजन और नमी की उपस्थिति में क्षय होती है। इसमें धातु का ऑक्साइड बनता है और धातु की सतह पर जंग की परत बन जाती है।
                 </li>
               </ol>
             </div>
           ),
         },
         {
           question: " 24. मोमबत्ती में मोम किस रूप में जलता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> मोमबत्ती में मोम वाष्प रूप में जलता है। जब मोमबत्ती जलाई जाती है, तो मोम पिघलकर वाष्प में बदल जाता है और फिर यह वाष्प ऑक्सीजन की उपस्थिति में जलता है, जिससे प्रकाश और गर्मी उत्पन्न होती है।
             </div>
           ),
         },
         {
           question: " 25. बारूद किन पदार्थों से मिलकर बना होता है?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b> <b style={{ color: "blue" }}> बारूद मुख्य रूप से तीन पदार्थों से मिलकर बना होता है: </b>
               </p>
               <ol className="ml-16">
                 <li>  (i) सल्फर (गंधक) </li>
                 <li>  (ii) कार्बन (कोयला) </li>
                 <li>(iii) नाइट्रेट (पोटैशियम नाइट्रेट या चीनी मिट्टी)</li>
               </ol>



             </div>
           ),
         },








//       ]
//     },


//     // chapter 8 कोशिका:  संरचना एवं प्रकार्य

//     {
//       chapterName: "कोशिका:  संरचना एवं प्रकार्य",
//       imageUrl: "/image/8th-S-Chap-8.png", // 🖼️ Image for this chapter
//       description: (
//         <h1><b style={{ color: "blue" }}> इस अध्याय में ह उर्वरक।</b></h1>

//       ),
//       questions: [

//         {
//           question: " 1. कोशिका क्या है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> सजीवों के संरचनात्मक एवं क्रियात्मक इकाई को कोशिका कहते हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 2. जंतु कोशिका किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> जंतुओं के शरीर में पाई जाने वाली कोशिकाएँ जंतु कोशिका कहलाती हैं। इनमें केंद्रक, माइटोकॉन्ड्रिया और लाइसोसोम पाए जाते हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 3. पादप कोशिका किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> पादप कोशिका पौधों के शरीर में पाई जाने वाली कोशिकाएँ होती हैं। इनमें केंद्रक, माइटोकॉन्ड्रिया, क्लोरोप्लास्ट और सेल्यूलोज़ की दीवार पाई जाती है।
//             </div>
//           ),
//         },
//         {
//           question: " 4. कोशिकाओं को किस प्रकार देखा जा सकता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> कोशिकाओं का आकार बहुत छोटा होता है जिसे देखने के लिए हमें सूक्ष्मदर्शी का प्रयोग करना पड़ता है।
//             </div>
//           ),
//         },
//         {
//           question: " 5. एक कोशिकीय जीव क्या होता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> वह जीव जो एक ही कोशिका से बना हो वह एक कोशिकीय जीव कहलाता है।
//               <br />
//               जैसे:— अमीबा और पारामिशियम
//             </div>
//           ),
//         },
//         {
//           question: " 6. बहुकोशिकीय जीव किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> जिन जीवों का शरीर कई कोशिकाओं से मिलकर बना होता है, उन्हें बहुकोशिकीय जीव कहते हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 7. कोशिका के किस भाग में कोशिकांग पाए जाते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> साइटोप्लाज्मा में।
//             </div>
//           ),
//         },
//         {
//           question: " 8. उत्तक क्या है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> उत्तक: एक ही प्रकार की कोशिकाओं के समूह को उत्तक कहते हैं। ये कोशिकाएँ आकार, संरचना और कार्य में समान होती हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 9. उस यंत्र का नाम बताइए जिससे कोशिका को देखा जा सकता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> माइक्रोस्कोप।
//             </div>
//           ),
//         },
//         {
//           question: " 10. कोशिका के मुख्य अंगत या भाग कौन-कौन से हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका के मुख्य अंगत कोशिका झिल्ली, कोशिका द्रव्य और केंद्रक है।
//             </div>
//           ),
//         },
//         {
//           question: " 11. कोशिका झिल्ली के अंदर पाये जाने वाले कोशिका अंगको के नाम बताइए?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका द्रव और केंद्रक।
//             </div>
//           ),
//         },
//         {
//           question: " 12. कोशिका के किस भाग को कोशिका का जीवित पदार्थ कहा जाता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> प्रोटेप्लाजमा को।
//             </div>
//           ),
//         },
//         {
//           question: " 13. प्रोटेप्लाजमा किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> जीवित कोशिका के अंदर के सभी भागों को प्रोटेप्लाजमा कहते हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 14. जीन किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> जीन: जीन एक अनुवांशिक इकाई है जो क्रोमोसोम में स्थित होती है और जीनेटिक गुणों को एक पीढ़ी से दूसरी पीढ़ी में स्थानांतरित करने में महत्वपूर्ण भूमिका निभाती है।
//             </div>
//           ),
//         },
//         {
//           question: " 15. किन कोशिकाओं की आकृति निश्‍चित नहीं होती?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> श्‍वेत रक्त कोशिका की आकृति निश्‍चित नहीं होती।
//             </div>
//           ),
//         },
//         {
//           question: " 16. मानव शरीर में सबसे छोटी एवं बड़ी कोशिका का नाम बताएँ?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> मानव शरीर में लाल रक्त कोशिकाएँ सबसे छोटी होती है। तंत्रिका कोशिका सबसे बड़ी कोशिका होती है।
//             </div>
//           ),
//         },
//         {
//           question: " 17. ऊतकों का निर्माण किस प्रकार होता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> बहुकोशिकीय जीवों में कोशिकाओं का विशिष्ट समूह ऊतकों का निर्माण करता है।
//             </div>
//           ),
//         },
//         {
//           question: " 18. मुर्गी के अंडे के पीला भाग एवं उजले भाग को क्या कहा जाता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> मुर्गी के अंडे के पीले भाग को एलब्यूमिन तथा उजला भाग योक कहलाता है। मुर्गी का यह अंडा एकल कोशिका रखता है।
//             </div>
//           ),
//         },
//         {
//           question: " 19. कोशिका का आकार किस बात पर निर्भर करता है?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका का आकार का संबंध किसी जीव या पौधे के आकार से न होकर उस कोशिका विशेष के कार्य से होता है।
//             </div>
//           ),
//         },
//         {
//           question: " 20. क्लोरोफिल या पर्णहरित किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> पत्तियों का हरा रंग उनकी कोशिकाओं में स्थित हरे रंग के लवक क्लोरोप्लास्ट या हरित लवक के कारण होता है, जिसे क्लोरोफिल पर्णहरित कहते हैं।
//             </div>
//           ),
//         },
//         {
//           question: " 21. कोशिका झिल्ली किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका झिल्ली एक पतली और लचीली परत होती है जो कोशिका के अंदरूनी हिस्से को बाहरी वातावरण से अलग करती है। यह झिल्ली कोशिका को सुरक्षा प्रदान करती है और पदार्थों के आदान-प्रदान को नियंत्रित करती है।
//             </div>
//           ),
//         },
//         {
//           question: " 22. कोशिका भित्ति किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> पादप कोशिकाओं की बाहरी परत जो सेल्यूलोज़ से बनी होती है और कोशिका को आकार और संरचना प्रदान करती है।
//             </div>
//           ),
//         },
//         {
//           question: " 23. केंद्रक झिल्ली किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> केंद्रक के चारों ओर स्थित एक दोहरी झिल्ली जो केंद्रक को कोशिका के सायटोप्लाज्म से अलग करती है और केंद्रक में आने-जाने वाले पदार्थों को नियंत्रित करती है।
//             </div>
//           ),
//         },
//         {
//           question: " 24. रंजक किसे कहते हैं?",
//           answer: (
//             <div>
//               <b style={{ color: "green" }}>उत्तर:—</b> रंजक: कोशिका में पाए जाने वाले रंगीन पदार्थों को रंजक कहते हैं। ये पदार्थ कोशिका को विशिष्ट रंग प्रदान करते हैं और अक्सर कोशिका की विशिष्ट कार्यों में भी भूमिका निभाते हैं।
//               <br />
//               <b style={{ color: "violet" }}>
//                 रंजकों के उदाहरण:
//               </b>
//               <ul className="ml-16">
//                 <li><b style={{ color: "red" }}>क्लोरोफिल:</b> पादप कोशिकाओं में पाया जाने वाला एक रंजक जो पौधों को हरा रंग प्रदान करता है और प्रकाश संश्‍लेषण में महत्वपूर्ण भूमिका निभाता है।</li>
//                 <li><b style={{ color: "red" }}>हीमोग्लोबिन:</b> जंतु कोशिकाओं में पाया जाने वाला एक रंजक जो लाल रक्त कोशिकाओं में पाया जाता है और ऑक्सीजन को शरीर के विभिन्न अंगों तक पहुंचाने में मदद करता है।</li>
//                 <li><b style={{ color: "red" }}>मेलानिन:</b> जंतु कोशिकाओं में पाया जाने वाला एक रंजक जो त्वचा, बालों और आंखों को रंग प्रदान करता है।</li>
//               </ul>
//             </div>
//           ),
//         },
//         {
//           question: " 25. जंतु कोशिका और पादप कोशिका में क्या अंतर है?",
//           answer: (
//             <div>
//               <p>
//                 <b style={{ color: "green" }}>उत्तर:—</b> <b style={{ color: "blue" }}> जंतु कोशिका और पादप कोशिका में निम्न अंतर है: </b>
//               </p>
//               <ul className="ml-16">
//                 <li><b style={{ color: "red" }}>पादप कोशिका में:</b>
//                   <ul className="ml-2">
//                     <li>कोशिका भित्ति होती है।</li>
//                     <li>क्लोरोप्लास्ट होते हैं।</li>
//                     <li>वैक्यूल्स बड़े होते हैं।</li>
//                     <li>लाइसोसोम नहीं होते हैं।</li>
//                     <li>सेंट्रियोल नहीं होते हैं।</li>
//                   </ul>
//                 </li>
//                 <li><b style={{ color: "red" }}>जंतु कोशिका में:</b>
//                   <ul className="ml-2">
//                     <li>कोशिका भित्ति नहीं होती है।</li>
//                     <li>क्लोरोप्लास्ट नहीं होते हैं।</li>
//                     <li>वैक्यूल्स छोटे होते हैं।</li>
//                     <li>लाइसोसोम होते हैं।</li>
//                     <li>सेंट्रियोल होते हैं।</li>
//                   </ul>
//                 </li>
//               </ul>
//             </div>
//           ),
//         },
//       ]





    
]



const QuestionAnswerPage = () => {
    return (
      <div className="p-4">
        {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
        {/* <Image sr></Image> */}
        <div className='flex justify-between'>
          <div>
        <Image src={"/image/8th-S-Chap-6.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image>
        </div>
  
        {/* <div className='border border-x-8  flex flex-col'>
          <h1>Topics Name</h1>
          <Link href={"#"}>Chapter 2</Link>
          <Link href={"#"}>Chapter 3</Link>
          <Link href={"#"}>Chapter 4</Link>
          <Link href={"#"}>Chapter 5</Link>
          <Link href={"#"}>Chapter 6</Link>
          <Link href={"#"}>Chapter 7</Link>
        </div> */}
  
        </div>
  
        {questions.map((faq, index) => (
          <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
            <h3 className="text-xl font-bold text-red-600 mb-2">
              प्रश्‍न: {faq.question}
            </h3>
            <div className="text-xl mt-2">
              {faq.answer}
            </div>
          </div>
        ))}
      </div>
    );
  };
  
  export default QuestionAnswerPage;