

import Image from 'next/image';
import Link from 'next/link';
import React from 'react';

const questions = [


  //     /// chapter 17

//     {
//       chapterName: "तारे एवं सौर परिवार",
//       imageUrl: "/image/8th-S-Chap-17.png", // 🖼️ Image for this chapter
//       description: (
//         <h1><b style={{ color: "blue" }}> इस अध्याय में ह उर्वरक।</b></h1>

//       ),
//       questions: [

        {
          question: " 1. सौर परिवार के सबसे बड़े और सबसे छोटा ग्रह का नाम बताइए?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> सौर परिवार के सबसे बड़े ग्रह का नाम <span style={{ color: "blue" }}>बृहस्पति</span> है, जबकि सबसे छोटे ग्रह का नाम <span style={{ color: "blue" }}>बुध</span> है।
            </div>
          ),
        },
        {
          question: " 2. क्या आकाश में सारे तारे गति करते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> नहीं, आकाश में सारे तारे गति नहीं करते हैं। कुछ तारे गति करते हैं, जबकि अन्य स्थिर रहते हैं।
            </div>
          ),
        },
        {
          question: " 3. कृत्रिम उपग्रह किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कृत्रिम उपग्रह एक मानव-निर्मित वस्तु है जो पृथ्वी या अन्य ग्रहों की परिक्रमा करती है।
            </div>
          ),
        },
        {
          question: " 4. उल्का एवं उल्का पिंड किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> उल्का एक छोटा खगोलीय पिंड है जो अंतरिक्ष से पृथ्वी की ओर आता है और वायुमंडल में प्रवेश करते समय जल जाता है, जिससे एक चमकदार पथ दिखाई देता है।
              <br />
              उल्का पिंड वह पिंड है जो उल्का के जलने के बाद शेष रहता है और पृथ्वी पर गिरता है।
            </div>
          ),
        },
        {
          question: " 5. पृथ्वी के विषुवत रेखा किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> पृथ्वी के चारों ओर ठीक मध्य में एक वृत्त की कल्पना की गई है। इसे <span style={{ color: "blue" }}>विषुवत रेखा</span> या भू–मध्य रेखा कहते हैं।
            </div>
          ),
        },
        {
          question: " 6. मंगल, बृहस्पति एवं शनि की संक्षिप्त में चर्चा करें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> मंगल, बृहस्पति और शनि सौर परिवार के तीन महत्वपूर्ण ग्रह हैं:
              <br />
              <span style={{ color: "blue" }}>(I) मंगल:</span> मंगल सौर परिवार का चौथा ग्रह है। इसका आकार छोटा है और इसकी सतह पर पहाड़, घाटियाँ और रेगिस्तान हैं।
              <br />
              <span style={{ color: "blue" }}>(II) बृहस्पति:</span> बृहस्पति सौर परिवार का सबसे बड़ा ग्रह है। इसका आकार बहुत बड़ा है और इसकी सतह पर गैसें और तरल पदार्थ हैं।
              <br />
              <span style={{ color: "blue" }}>(III) शनि:</span> शनि सौर परिवार का छठा ग्रह है। इसका आकार बड़ा है और इसकी सतह पर गैसें और तरल पदार्थ हैं। इसके चारों ओर वलय हैं जो बर्फ और चट्टानों से बने हैं।
            </div>
          ),
        },
        {
          question: " 7. धूमकेतु को परिभाषित करें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> धूमकेतु एक छोटा, बर्फ और धूल से बना खगोलीय पिंड है जो सूर्य की परिक्रमा करता है। जब धूमकेतु सूर्य के निकट आता है, तो इसकी बर्फ पिघलने लगती है और एक पुच्छल तारा जैसी आकृति बनती है।
            </div>
          ),
        },
        {
          question: " 8. क्षुद्र ग्रह किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> क्षुद्र ग्रह एक छोटा खगोलीय पिंड है जो सूर्य की परिक्रमा करता है, लेकिन इसका आकार इतना बड़ा नहीं होता है कि यह एक पूर्ण ग्रह बन सके।
            </div>
          ),
        },
        {
          question: " 9. शुक्र ग्रह के बारे में बताएँ?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> शुक्र ग्रह सौर परिवार का दूसरा ग्रह है। इसका आकार पृथ्वी के आकार के समान है, लेकिन इसकी सतह पर बहुत अधिक गर्मी और दबाव है। शुक्र ग्रह को अक्सर &apos; <span style={{ color: "blue" }}>पृथ्वी की बहन</span>&apos; कहा जाता है।
            </div>
          ),
        },
        {
          question: " 10. ध्रुव तारा किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> ध्रुव तारा एक तारा है जो पृथ्वी के उत्तरी ध्रुव के ठीक ऊपर स्थित होता है। यह तारा पृथ्वी के घूर्णन के कारण हमेशा एक ही स्थान पर दिखाई देता है।
            </div>
          ),
        },
        {
          question: " 11. सौर मंडल किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> सौर मंडल सूर्य और उसके ग्रहों, उपग्रहों, क्षुद्रग्रहों, धूमकेतुओं और अन्य खगोलीय पिंडों का समूह है जो सूर्य की परिक्रमा करते हैं।
            </div>
          ),
        },
        {
          question: " 11. कक्षा किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> कक्षा एक ऐसा मार्ग या पथ है जिस पर एक खगोलीय पिंड, जैसे कि ग्रह, उपग्रह या धूमकेतु, किसी अन्य खगोलीय पिंड की परिक्रमा करता है।
            </div>
          ),
        },
        {
          question: " 12. सौरमंडल में ग्रहों की संख्या क्रमावली बताइये?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:-</b> सौरमंडल में ग्रहों की संख्या और उनकी क्रमावली निम्नलिखित है:
              <ul className="ml-14 list-none text-blue-600">
                <li>(I) बुध</li>
                <li>(II) शुक्र</li>
                <li>(III) पृथ्वी</li>
                <li>(IV) मंगल</li>
                <li>(V) बृहस्पति</li>
                <li>(VI) शनि</li>
                <li>(VII) यूरेनस</li>
                <li>(VIII) नेप्च्यून</li>
              </ul>
            </div>
          ),
        },
        {
          question: " 13. संक्षिप्त में पृथ्वी की चर्चा करें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> पृथ्वी सौर परिवार का तीसरा ग्रह है और यह एकमात्र ऐसा ग्रह है जहां जीवन पाया जाता है। इसका आकार लगभग गोल है और इसकी सतह पर महासागर, महाद्वीप, पहाड़ और घाटियाँ हैं। पृथ्वी का वायुमंडल ऑक्सीजन और नाइट्रोजन से बना है और इसका तापमान जीवन के लिए उपयुक्त है।
            </div>
          ),
        },
        {
          question: " 14. पृथ्वी पर जीवन होने का क्या कारण है?",
          answer: (
            <div>
              <p>
                <b style={{ color: "green" }}>उत्तर:—</b> <span style={{ color: "blue" }}> पृथ्वी पर जीवन होने के मुख्य कारण हैं:</span>
              </p>
              <ul className="ml-16 text-red-500">
                <li>(I) ठीक तापमान</li>
                <li>(II) जल की उपलब्धता</li>
                <li>(III) उपयुक्त वायुमंडल</li>
                <li>(IV) सूर्य से सही दूरी</li>
              </ul>
            </div>
          ),
        },
        {
          question: " 15. तारामंडल को परिभाषित करें?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> तारामंडल एक ऐसा क्षेत्र है जिसमें कई तारे, ग्रह, और अन्य खगोलीय पिंड शामिल होते हैं। यह एक विशाल आकाशीय क्षेत्र है जिसमें कई खगोलीय वस्तुएं एक साथ आती हैं।
            </div>
          ),
        },
        {
          question: " 16. प्रकाश की चाल क्या है?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> प्रकाश की चाल लगभग <span style={{ color: "blue" }}>300,000 किलोमीटर प्रति सेकंड (किमी/सेकंड)</span> है।
            </div>
          ),
        },
        {
          question: " 17. सूर्य क्या है?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> सूर्य हमारे सौरमंडल का केंद्रीय तारा है, जो एक विशाल गैसीय गोला है। यह अपने गुरुत्वाकर्षण बल से सौरमंडल के सभी ग्रहों, उपग्रहों और अन्य वस्तुओं को आकर्षित करता है। सूर्य की रोशनी और ऊर्जा पृथ्वी पर जीवन के लिए आवश्यक है।
            </div>
          ),
        },
        {
          question: " 18. चंद्रमा पर पहली बार कदम रखने वाले कौन थे और इसके बाद चंद्रमा पर कौन गया?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> चंद्रमा पर पहली बार कदम रखने वाले <span style={{ color: "blue" }}>नील आर्मस्ट्रांग</span> थे। वह अमेरिकी खगोलयात्री और चंद्रमा पर कदम रखने वाले पहले व्यक्ति थे। इसके बाद चंद्रमा पर जाने वाले <span style={{ color: "blue" }}>बज़ एल्ड्रिन</span> थे, जो चाँद पर उतरने वाले दूसरे व्यक्ति बने।
            </div>
          ),
        },
        {
          question: " 19. ग्रह किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> ग्रह एक ऐसा खगोलीय पिंड है जो सूर्य या किसी अन्य तारे की परिक्रमा करता है। ग्रह अपने गुरुत्वाकर्षण बल से अपने आकार को बनाए रखता है और इसकी अपनी कक्षा होती है।
            </div>
          ),
        },
        {
          question: " 20. गैलीलियो ने अपना दूरबीन कब विकसित किया था?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> गैलीलियो ने अपना दूरबीन <span style={{ color: "blue" }}>1609</span> में विकसित किया था।
            </div>
          ),
        },
        {
          question: " 21. ग्रहों के परिक्रमा का आरेख खींचिए जिसमें सूर्य के चारों ओर परिक्रमा करते ग्रहों को दर्शाया गया हो?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> इस प्रश्न के उत्तर के रूप में एक आरेख की आवश्यकता होगी, जिसमें सूर्य के चारों ओर ग्रहों की परिक्रमा को दिखाया जाएगा। आप इसे बनाने के लिए किसी चित्रण उपकरण का उपयोग कर सकते हैं या मैं एक और आरेख बनाने में मदद कर सकता हूँ।
            </div>
          ),
        }



    
]



const QuestionAnswerPage = () => {
    return (
      <div className="p-4">
        {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
        {/* <Image sr></Image> */}
        <div className='flex justify-between'>
          <div>
        <Image src={"/image/8th-S-Chap-17.png"} className=' rounded mb-12' width={2500} height={300} alt='img'></Image>
        </div>
  
        {/* <div className='border border-x-8  flex flex-col'>
          <h1>Topics Name</h1>
          <Link href={"#"}>Chapter 2</Link>
          <Link href={"#"}>Chapter 3</Link>
          <Link href={"#"}>Chapter 4</Link>
          <Link href={"#"}>Chapter 5</Link>
          <Link href={"#"}>Chapter 6</Link>
          <Link href={"#"}>Chapter 7</Link>
        </div> */}
  
        </div>
  
        {questions.map((faq, index) => (
          <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
            <h3 className="text-xl font-bold text-red-600 mb-2">
              प्रश्‍न: {faq.question}
            </h3>
            <div className="text-xl mt-2">
              {faq.answer}
            </div>
          </div>
        ))}
      </div>
    );
  };
  
  export default QuestionAnswerPage;