import Image from "next/image";

const questions = [

    {
        question: "1. भोजन की आवश्यकता क्यों होती है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> हमारी वृद्धि और विकास के लिए, शरीर के उत्तकों के टूट-फूट की मरम्मत के लिए, जीवद्रव्य में संश्लेषण हेतु तथा अन्य कार्यों के लिए भोजन की आवश्यकता होती है।
          </div>
        ),
      },
      {
        question: "2. इस पृथ्वी पर कितने प्रकार के जीव हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> इस पृथ्वी पर दो प्रकार के जीव हैं।
            <ul>
              <li><b>स्वपोषी:—</b> जो जीव अपना भोजन प्रकाश संश्लेषण की प्रक्रिया द्वारा स्वयं बनाते हैं। <b>जैसे:—</b> हरे पौधे।</li>
              <li><b>परपोषी:—</b> जो जीव अपना भोजन बनाने के लिए दूसरे जीवों पर निर्भर रहते हैं। <b>जैसे:—</b> मनुष्य, कवक।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "3. 2020 तक हमारे देश की आबादी कितनी थी?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 2020 तक हमारे देश की आबादी लगभग 134 करोड़ थी।
          </div>
        ),
      },
      {
        question: "4. फसल उत्पादन में किस प्रकार से वृद्धि हुई?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> भारतीय वैज्ञानिकों के प्रयास से उच्च किस्मों के बीजों के प्रयोग तथा उन्नत खेती से हरित क्रांति द्वारा फसल उत्पादन में वृद्धि हुई।
          </div>
        ),
      },
      {
        question: "5. श्वेत क्रांति किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> हमारे देश में दूध के उत्पादन में भारी मात्रा में वृद्धि हुई जिसे श्वेत क्रांति कहते हैं।
          </div>
        ),
      },
      {
        question: "6. फसल उत्पादन क्या है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> मानव एवं अन्य जीवों के शरीर के लिए आवश्यक पोषक तत्व जैसे कार्बोहाइड्रेट, वसा, प्रोटीन, विटामिन और खनिज, फसलों के उत्पादन से प्राप्त होते हैं।
          </div>
        ),
      },
      {
        question: "7. मौसम के अनुरूप कितने प्रकार के फसल होते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> मौसम के अनुरूप तीन प्रकार के फसल होते हैं:
            <ul>
              <li><b>खरीफ फसल:—</b> वर्षा ऋतु में उगने वाले फसल। <b>जैसे:—</b> धान, ज्वार, बाजरा।</li>
              <li><b>रबी फसल:—</b> शीत ऋतु में उगने वाले फसल। <b>जैसे:—</b> गेहूँ, चना, तीसी।</li>
              <li><b>ग्रीष्म फसल:—</b> गर्मी के मौसम में उगने वाली दलहनी फसलें। <b>जैसे:—</b> मूंग, उरद, मटर, अरहर।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "8. पादप संकरण किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> इस प्रकार का फसल जिसमें एक कम गुण वाली और दूसरी अधिक गुण वाली फसल को नवीन प्रजाति के द्वारा विकसित किया जाता है, उसे पादप संकरण कहते हैं।
          </div>
        ),
      },
      {
        question: "9. संकर या हायब्रीड किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> पादप संकरण के फलस्वरूप विकसित नवीन समुन्नत फसल किस्म को संकर या हायब्रीड कहते हैं।
          </div>
        ),
      },
      {
        question: "10. पादप प्रजनन किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> फसलों की समुन्नत प्रजातियों के सुधार के विज्ञान को पादप प्रजनन कहते हैं।
          </div>
        ),
      },
      {
        question: "11. फसल की समुन्नत किस्म के गुण और उनके लाभ को लिखें?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> फसल की समुन्नत किस्म के गुण और उनके लाभ निम्नलिखित हैं:
            <ul>
              <li><b>उच्च उपज:—</b> समुन्नत किस्मों से पारंपरिक किस्मों की अपेक्षा अधिक पैदावार मिलती है।</li>
              <li><b>खाद्य का बेहतर असर:—</b> रासायनिक उर्वरकों का प्रभाव समुन्नत किस्मों पर अधिक होता है जिससे पैदावार अच्छी मिलती है।</li>
              <li><b>बौनी प्रजातियाँ:—</b> समुन्नत किस्में प्रायः बौनी होती हैं और अधिक मजबूत होती हैं।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "12. खाद्य एवं उर्वरक कितने प्रकार के होते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> खाद्य एवं उर्वरक दो प्रकार के होते हैं:
            <ul>
              <li><b>प्राकृतिक उर्वरक:—</b> जंतुओं के गोबर, मलमूत्र आदि से प्राप्त प्राकृतिक पदार्थ जिसमें नाइट्रोजन, फॉस्फोरस और पोटाश होते हैं।</li>
              <li><b>रासायनिक उर्वरक:—</b> व्यावसायिक रूप से तैयार अकार्बनिक एवं कार्बनिक यौगिक जिनमें नाइट्रोजन, पोटेशियम, और फॉस्फोरस अधिक मात्रा में पाए जाते हैं।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "13. खाद्य के प्रकार क्या हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> खाद्य निम्नलिखित प्रकार के होते हैं:
            <ul>
              <li><b>कम्पोस्ट:—</b> घास–भूसा, मलजल, सब्जी का कूड़ा, जानवरों का कचरा, खरपतवार आदि से तैयार खाद्य। इसे 3 से 6 माह तक छोड़ देने पर कम्पोस्ट बनता है।</li>
              <li><b>वर्मीकम्पोस्ट:—</b> केंचुओं की मदद से तैयार किया गया कम्पोस्ट।</li>
              <li><b>हरी खाद्य:—</b> जीवित पौधों या उनके भागों को मिट्टी में दबाकर बनाई गई खाद।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "14. कार्बनिक खेती किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> जिस खेती में कार्बनिक पदार्थों का उपयोग किया जाता है, उसे कार्बनिक खेती कहते हैं। <b>जैसे:—</b> पेड़–पौधों के अपशिष्ट, जानवरों के मलमूत्र इत्यादि।
          </div>
        ),
      },
      {
        question: "15. सिंचाई किसे कहते हैं और इसके क्या-क्या साधन हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> फसलों में जल की आवश्यकता को पूरा करने की प्रक्रिया को सिंचाई कहते हैं।
            <b> सिंचाई के साधन:—</b> कुआँ, तालाब, नदियाँ, नहरे आदि।
          </div>
        ),
      },
      {
        question: "16. मिश्रित फसल उत्पादन किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> एक ही समय में एक से अधिक फसलों का उत्पादन करना मिश्रित फसल उत्पादन कहलाता है। <b>जैसे:—</b> गेंहूँ और सरसों, गेंहूँ और चना, सोयाबीन और अरहर।
          </div>
        ),
      },
      {
        question: "17. फसल चक्रण किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> एक ही भूखंड पर बदल-बदलकर फसल उगाने की प्रक्रिया को फसल चक्रण कहते हैं। <b>जैसे:—</b> गेंहूँ, धान, मकई आदि।
          </div>
        ),
      },
      {
        question: "18. पीड़क या पेस्टस किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> पौधों को नुकसान पहुँचाने वाले कीट, जीवाणु और कवक को पीड़क या पेस्टस कहते हैं।
          </div>
        ),
      },
      {
        question: "19. फसल सुरक्षा किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> फसलों को पीड़कों और अन्य हानिकारक जीवों से मुक्त रखने की प्रक्रिया को फसल सुरक्षा कहते हैं।
          </div>
        ),
      },
      {
        question: "20. खरपतवार या वीड्स किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> अवांछित पौधे जो उगाए जाने वाले पौधों के साथ स्वतः उग जाते हैं, उन्हें खरपतवार या वीड्स कहते हैं। <b>जैसे:—</b> बथुआ, घास–दूब, मोथा।
          </div>
        ),
      },
      {
        question: "21. निराई या वीडिंग किसे कहते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> खेतों से खरपतवारों को हटाने की प्रक्रिया को निराई या वीडिंग कहते हैं। <b>जैसे:—</b> चौलाई, बथुआ, मोथा।
          </div>
        ),
      },
      {
        question: "22. खरपतवार नियंत्रण के तरीके क्या हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> खरपतवार नियंत्रण के तरीके निम्नलिखित हैं:
            <ul>
              <li>
                <b>यांत्रिक विधियों द्वारा:—</b> खुरपी की सहायता से खरपतवार हटाए जाते हैं। <b>जैसे:—</b> अरहर, मक्का।
              </li>
              <li>
                <b>कृषि क्रियाओं द्वारा:—</b> अंतरफसल उत्पादन, सहफसली खेती, और फसल चक्रण से खरपतवार वृद्धि पर नियंत्रण पाया जाता है।
              </li>
            </ul>
          </div>
        ),
      },
      {
        question: "23. फसल रोग क्या है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> फसल में रोग पैदा करने वाले सूक्ष्मजीव जैसे वाइरस, जीवाणु और कवक, मिट्टी, पानी, और हवा में मौजूद होते हैं। ये पौधों के विभिन्न भागों को नुकसान पहुँचाते हैं, इसे फसल रोग कहा जाता है।
          </div>
        ),
      },
      {
        question: "24. फसलों की रोगों से सुरक्षा के उपाय क्या हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> रोगों से सुरक्षा के लिए पीड़कनाशी (पेस्टिसाइट्स) का उपयोग किया जाता है। इसके लिए कवकनाशी और कीटनाशी का छिड़काव किया जाता है।
          </div>
        ),
      },
      {
        question: "25. अनाज का भंडारण क्यों आवश्यक है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> खाद्यान्न साल में एक बार काटी जाती है। इसे नष्ट होने से बचाने और सुरक्षित रखने के लिए भंडारण आवश्यक होता है।
          </div>
        ),
      },
      {
        question: "26. भंडारण के दौरान नष्ट करने वाले घटक क्या हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> भंडारण के दौरान दो प्रकार के घटक अनाज को नष्ट कर सकते हैं:
            <ul>
              <li>
                <b>अजैविक घटक:—</b> 
                <ul>
                  <li><b>नमी:—</b> खाद्यान्न में नमी 14% से अधिक नहीं होनी चाहिए।</li>
                  <li><b>तापमान:—</b> खाद्यान्न का सुरक्षित भंडारण कम तापमान पर होना चाहिए।</li>
                </ul>
              </li>
              <li>
                <b>जैविक घटक:—</b> खमीर, फफूँद, कवक जैसे सूक्ष्मजीव खाद्यान्न को नुकसान पहुँचाते हैं।
              </li>
            </ul>
          </div>
        ),
      },
      
      

         
         
         
         

            ]



              const QuestionAnswerPage = () => {
                return (
                  <div className="p-4">
                    {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
                    {/* <Image sr></Image> */}
                    <div className='flex justify-between'>
                      <div>
                    {/* <Image src={"/image/8th-S-Chap-1.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image> */}
                    </div>
              
                    {/* <div className='border border-x-8  flex flex-col'>
                      <h1>Topics Name</h1>
                      <Link href={"#"}>Chapter 2</Link>
                      <Link href={"#"}>Chapter 3</Link>
                      <Link href={"#"}>Chapter 4</Link>
                      <Link href={"#"}>Chapter 5</Link>
                      <Link href={"#"}>Chapter 6</Link>
                      <Link href={"#"}>Chapter 7</Link>
                    </div> */}
              
                    </div>
              
                    {questions.map((faq, index) => (
                      <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
                        <h3 className="text-xl font-bold text-red-600 mb-2">
                          प्रश्‍न: {faq.question}
                        </h3>
                        <div className="text-xl mt-2">
                          {faq.answer}
                        </div>
                      </div>
                    ))}
                  </div>
                );
              };
              
              export default QuestionAnswerPage;
              
