import Image from "next/image";

const questions = [

 
    {
      question: "1. रसायनिक संरचना के आधार पर पदार्थ का वर्गीकरण?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> रासायनिक संरचना के आधार पर पदार्थ को
          तीन वर्गों में बांटा गया है:
          <ul>
            <li>तत्व</li>
            <li>यौगिक</li>
            <li>मिश्रण</li>
          </ul>
        </div>
      ),
    },
    {
      question: "2. तत्व किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> तत्व एक शुद्ध पदार्थ है जो रासायनिक विधि
          द्वारा विभाजित नहीं किया जा सकता है।<br />
          <b style={{color:"violet"}}> <b style={{color:"violet"}}> जैसे:—</b></b> हाइड्रोजन (H), ऑक्सीजन(O), नाइट्रोजन(N), क्लोरीन(CL), कैल्शियम(Ca),
          सोना(Au), तांबा(Cu), चांदी(Ag)
        </div>
      ),
    },
    {
      question: "3. तत्व की विशेषताएँ क्या हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> तत्व की विशेषताएँ निम्नलिखित हैं:
          <ul>
            <li>तत्व एक ही प्रकार के परमाणु का बना होता है।</li>
            <li>सभी तत्व के गुण एक दूसरे से अलग होते हैं।</li>
            <li>तत्व को रासायनिक या भौतिक विधि द्वारा विभाजित नहीं किया जा सकता है।</li>
            <li>जल एक तत्व नहीं होता क्योंकि जल में विद्युत धारा प्रवाहित करने पर हाइड्रोजन (H) और ऑक्सीजन (O) बनते हैं।</li>
          </ul>
        </div>
      ),
    },
    {
      question: "4. तत्वों का वर्गीकरण?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> तत्वों को दो भागों में बांटा गया है:
          <ul>
            <li>धातु</li>
            <li>अधातु</li>
          </ul>
        </div>
      ),
    },
    {
      question: "5. धातु किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> धातु वे पदार्थ होते हैं जो चमकदार, कठोर और ताप व
          विद्युत के सुचालक होते हैं।<br />
         <b style={{color:"violet"}}> जैसे:—</b> लोहा, तांबा, सोना, चांदी, एल्युमीनियम।
        </div>
      ),
    },
    {
      question: "6. अधातु किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> अधातु वे पदार्थ होते हैं जो चमकदार नहीं होते, कठोर
          नहीं होते और ताप व विद्युत के कुचालक होते हैं।<br />
         <b style={{color:"violet"}}> जैसे:—</b> कार्बन, नाइट्रोजन, ऑक्सीजन, फॉस्फोरस आदि।
        </div>
      ),
    },
    {
      question: "7. धातु के गुण को लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> धातु के गुण निम्नलिखित हैं:
          <ul>
            <li>धातु में एक विशेष प्रकार की चमक होती है।</li>
            <li>धातु ऊष्मा एवं विद्युत का सुचालक होते हैं।</li>
            <li>धातु कमरे के ताप पर द्रव होते हैं।</li>
          </ul>
         <b style={{color:"violet"}}> जैसे:—</b> सोडियम (Na), ताँबा (Cu), सोना (Au), सिल्वर (Ag), लोहा (Fe), एल्यूमिनियम (Al) आदि।
        </div>
      ),
    },
    {
      question: "8. अधातु के गुण लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> अधातु के गुण निम्नलिखित हैं:
          <ul>
            <li>अधातु में एक विशेष प्रकार की चमक नहीं होती है।</li>
            <li>अधातु ऊष्मा एवं विद्युत का कुचालक होते हैं।</li>
            <li>अधातु गैस के रूप में पाये जाते हैं।</li>
          </ul>
         <b style={{color:"violet"}}> जैसे:—</b> हाइड्रोजन (H), ऑक्सीजन (O), नाइट्रोजन (N), क्लोरीन (Cl) आदि।
        </div>
      ),
    },
    {
      question: "9. यौगिक किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> दो या दो से अधिक तत्व संयोग करके एक नया पदार्थ
          बनता है, उसे यौगिक कहते हैं।<br />
         <b style={{color:"violet"}}> जैसे:—</b> CO₂, H₂O, CaCO₃ आदि।
        </div>
      ),
    },
    {
      question: "10. यौगिक के गुण को लिखें?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> यौगिक के गुण निम्नलिखित हैं:
          <ul>
            <li>यौगिक के कणों को भौतिक विधि द्वारा अलग-अलग नहीं किया जा सकता है।</li>
            <li>यौगिक के गुण और तत्व के गुण अलग-अलग होते हैं।</li>
            <li>किसी यौगिक के बनने में ऊष्मा या प्रकाश के रूप में ऊर्जा का अवशोषण होता है।</li>
            <li>किसी यौगिक में उपस्थित तत्व का द्रव्यमान एक निश्‍चित अनुपात में होता है।</li>
            <li>यौगिक के द्रवनांक और क्वथनांक निश्‍चित होते हैं।</li>
          </ul>
          <b style={{color:"violet"}}> जैसे:—</b> हाइड्रोजन या ऑक्सीजन गैस अभिक्रिया नहीं करते हैं। लेकिन ऊष्मा प्रदान कर देने से
          हाइड्रोजन और ऑक्सीजन गैस अभिक्रिया करके जल बनता है।
        </div>
      ),
    },
    {
      question: "11. तत्व और यौगिक में क्या अंतर है?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> तत्व और यौगिक में निम्नलिखित अंतर है:
          <ul>
            <li>
              <b style={{color: "blue"}}>तत्व:</b>
              <ul>
                <li>तत्व को दो या दो से अधिक पदार्थ में विभाजित नहीं किया जाता है।</li>
                <li>तत्व एक ही प्रकार के परमाणु का बना होता है।</li>
                <li>तत्व के भौतिक और रासायनिक गुण यौगिक से भिन्न होते हैं।</li>
                <li>तत्व एक ही पदार्थ का बना होता है।</li>
              </ul>
            </li>
            <li>
              <b style={{color: "blue"}}>यौगिक:</b>
              <ul>
                <li>यौगिक को रासायनिक विधि द्वारा विभाजित किया जाता है।</li>
                <li>यौगिक विभिन्न प्रकार के परमाणु का बना होता है।</li>
                <li>यौगिक के भौतिक और रासायनिक गुण तत्व से भिन्न होते हैं।</li>
                <li>यौगिक दो या दो से अधिक पदार्थ से बना होता है।</li>
              </ul>
            </li>
          </ul>
        </div>
      ),
    },
    {
      question: "12. मिश्रण किसे कहते हैं?",
      answer: (
        <div>
          <b style={{ color: "green" }}>उत्तर:—</b> दो या दो से अधिक पदार्थ तत्व या यौगिक संयोग करके मिश्रण
          बनता है। <b style={{color:"violet"}}> जैसे:—</b> वायु: वायु में नाइट्रोजन, ऑक्सीजन, कार्बन डाइऑक्साइड और जलवाष्प का मिश्रण होता है।
        </div>
      ),
    },
      {
        question: "12. मिश्रण के गुण को लिखें?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 
            मिश्रण के गुण निम्नलिखित हैं:
            <ul>
              <li>मिश्रण समांग या विषमांग हो सकता है।</li>
              <ul>
                <li>जल में चीनी का मिश्रण समांग होता है।</li>
                <li>जल में तेल का मिश्रण विषमांग होता है।</li>
                <li>बालू और नमक का मिश्रण विषमांग होते हैं।</li>
                <li>इसमें बालू और नमक के कण को आसानी से देख सकते हैं।</li>
              </ul>
              <li>मिश्रण के कणों को छानना, वाष्पन, ऊर्ध्वपातन और चुंबकीय पृथक्करण विधि द्वारा अलग-अलग किया जाता है।</li>
              <li>मिश्रण के बनने में ऊर्जा का अवशोषण नहीं होता है।</li>
              <li>मिश्रण के द्रवनांक और क्वथनांक निश्‍चित नहीं होते हैं।</li>
              <li>मिश्रण के बनने में कोई रासायनिक अभिक्रिया नहीं होती है।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "13. मिश्रण कितने प्रकार के होते हैं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> मिश्रण के प्रकार निम्नलिखित हैं:
            <ul>
              <li>ठोस–ठोस का मिश्रण:— चीनी और बालू का मिश्रण ठोस–ठोस का मिश्रण कहलाता है।</li>
              <li>ठोस–द्रव का मिश्रण:— नमक और जल का मिश्रण ठोस–द्रव का मिश्रण कहलाता है।</li>
              <li>ठोस–गैस का मिश्रण:— मिट्टी के कणों के बीच रिक्त स्थान होते हैं जिसमें वायु उपस्थित रहते हैं।</li>
              <li>द्रव–गैस का मिश्रण:— सभी गैस द्रव में उपस्थित रहते हैं। हाइड्रोजन, ऑक्सीजन, नाइट्रोजन गैस जल के संपर्क में रहते हैं।</li>
              <li>गैस–गैस का मिश्रण:— वायु कई गैसों का मिश्रण होता है, इसे गैस–गैस का मिश्रण कहते हैं।</li>
              <li>द्रव–द्रव का मिश्रण:— जल और अल्कोहल का मिश्रण द्रव–द्रव का मिश्रण कहलाता है। जैसे: जल और तेल का मिश्रण।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "14. ऑक्सीजन एक तत्व है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 
            <ul>
              <li>ऑक्सीजन में किसी दूसरे तत्व की उपस्थिति नहीं पाई गई है।</li>
              <li>ऑक्सीजन हाइड्रोजन से अभिक्रिया करके जल बनता है।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "15. वायु एक मिश्रण है यौगिक नहीं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 
            वायु कई गैसों का मिश्रण होती है, इसमें नाइट्रोजन, ऑक्सीजन और कार्बन डाइऑक्साइड गैस पाई जाती है, ये गैस आपस में अभिक्रिया नहीं करते हैं। इसलिए वायु एक मिश्रण है, यौगिक नहीं।
          </div>
        ),
      },
      {
        question: "16. मिश्रण और यौगिक में क्या अंतर है?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> मिश्रण और यौगिक में निम्न अंतर है:
            <ul>
              <li>
                <b style={{color: "blue"}}>मिश्रण:</b>
                <ul>
                  <li>दो या दो से अधिक पदार्थ का मिलना मिश्रण कहलाता है।</li>
                  <li>मिश्रण समांग या विषमांग हो सकता है।</li>
                  <li>मिश्रण के बनने में कोई नया पदार्थ नहीं बनता है।</li>
                  <li>मिश्रण के कणों को सरल यांत्रिक विधि द्वारा पृथक किया जा सकता है।</li>
                </ul>
              </li>
              <li>
                <b style={{color: "blue"}}>यौगिक:</b>
                <ul>
                  <li>दो या दो से अधिक पदार्थ मिलने से एक नया पदार्थ बनता है।</li>
                  <li>यौगिक समांग होते हैं।</li>
                  <li>यौगिक के बनने से एक नया पदार्थ बनता है।</li>
                  <li>यौगिक के कणों को सरल यांत्रिक विधि द्वारा पृथक नहीं किया जा सकता है।</li>
                </ul>
              </li>
            </ul>
          </div>
        ),
      },
      {
        question: "17. जल एक यौगिक है मिश्रण नहीं?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 
            <ul>
              <li>हाइड्रोजन और ऑक्सीजन अभिक्रिया करके जल बनता है।</li>
              <li>जल को छानकर हाइड्रोजन और ऑक्सीजन में अलग-अलग नहीं किया जा सकता है।</li>
              <li>जल का क्वथनांक 100°C होता है।</li>
            </ul>
          </div>
        ),
      },
      {
        question: "18. कुछ उपयोग में आने वाले मिश्रण?",
        answer: (
          <div>
            <b style={{ color: "green" }}>उत्तर:—</b> 
            उपयोग में आने वाले मिश्रण निम्नलिखित हैं:
            <ul>
              <li>
                <b style={{color: "blue"}}>मिश्रधातु:</b> धातु और अधातु का समांग मिश्रण मिश्रधातु कहलाता है। 
                <b style={{color:"violet"}}> जैसे:—</b> सोना को चांदी और तांबा के साथ मिश्रित कर मिश्रधातु बनाया जाता है।
              </li>
              <li>
                <b style={{color: "blue"}}>वायु:</b> वायु में नाइट्रोजन, ऑक्सीजन और कार्बन डाइऑक्साइड का मिश्रण होता है।
              </li>
              <li>
                <b style={{color: "blue"}}>दूध:</b> दूध एक शुद्ध पदार्थ नहीं होता है, इसमें जल, वसा और प्रोटीन का मिश्रण होता है।
              </li>
            </ul>
          </div>
        ),
      },
        {
          question: "19. मिश्रण के कणों को अलग-अलग करने की विधि क्या है?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b> 
              मिश्रण के कणों को अलग-अलग करने की विधि निम्नलिखित हैं:
              <ul>
                <li><b style={{color: "blue"}}>हाथ से चुनकर अलग-अलग करना:</b> मिश्रण में उपस्थित बड़े आकार वाले कण को हाथ से चुनकर अलग किया जा सकता है। जैसे चावल में उपस्थित पत्थर के टुकड़े को हाथ से चुनकर अलग किया जाता है।</li>
                <li><b style={{color: "blue"}}>चलनी से छानकर:</b> मिश्रण में उपस्थित बड़े आकार के टुकड़े को चलनी से छानकर अलग किया जाता है। जैसे: 
                  <ul>
                    <li>बालू में उपस्थित पत्थर के टुकड़े को चलनी से छानकर अलग किया जाता है।</li>
                    <li>गेहूं के आटे से चोकर को चलनी से छानकर अलग किया जाता है।</li>
                  </ul>
                </li>
                <li><b style={{color: "blue"}}>मिश्रण के कणों को छानकर अलग करना:</b> ऐसे मिश्रण जिसमें एक पदार्थ द्रव हो और दूसरा ठोस हो, इसको छानकर अलग किया जाता है। जैसे: जल में उपस्थित बालू के कण को अलग किया जाता है।</li>
                <li><b style={{color: "blue"}}>चुंबकीय पृथक्करण:</b> वैसे मिश्रण जिसमें एक कण लोहा हो, इस मिश्रण के कणों को चुंबक द्वारा अलग किया जाता है। जैसे: लौह–चूर्ण और गंधक के मिश्रण के कणों को चुंबकीय विधि द्वारा अलग किया जाता है।</li>
                <li><b style={{color: "blue"}}>वाष्पन:</b> वाष्पन विधि द्वारा ठोस पदार्थ के कणों को अलग करते हैं। जैसे: नमक का जलीय विलयन से जल को वाष्पित कर नमक प्राप्त किया जाता है।</li>
                <li><b style={{color: "blue"}}>उर्ध्वपातन:</b> वैसे मिश्रण जिसका एक कण बिना पिछले ही वाष्प में परिवर्तन होता है, उसे उर्ध्वपातन कहते हैं। जैसे: साधारण नमक और अमोनियम क्लोराइड के मिश्रण से अमोनियम क्लोराइड को उर्ध्वपातन विधि द्वारा अलग किया जाता है।</li>
                <li><b style={{color: "blue"}}>रवाकरण:</b> वैसे विलयन जिससे शुद्ध ठोस पदार्थ को पृथक किया जाता है। जैसे: समुद्री जल से प्राप्त नमक में कई अशुद्ध पदार्थ पाये जाते हैं, अशुद्ध पदार्थ को दूर करने के लिए इसमें फिटकिरी मिलाया जाता है।</li>
                <li><b style={{color: "blue"}}>स्त्रवण:</b> वह प्रक्रिया जिसमें किसी द्रव को गर्म करके वाष्प में परिवर्तित किया जाता है, फिर उस वाष्प को ठंडा करके पुनः द्रव में संघनित किया जाता है।</li>
                <li><b style={{color: "blue"}}>बारूद के कणों को पृथक करना:</b> बारूद पोटैशियम नाइट्रेट, गंधक और चारकोल का मिश्रण होता है। इस मिश्रण को जल में मिलाने पर गंधक और चारकोल जल में नहीं घुलते हैं, और इस मिश्रण को छानकर गंधक और चारकोल अलग कर लिया जाता है।</li>
                <li><b style={{color: "blue"}}>साधारण नमक और बालू के मिश्रण के कणों को पृथक करना:</b> साधारण नमक जल में घुल जाते हैं लेकिन बालू जल में नहीं घुलते हैं। इस मिश्रण को छानकर बालू को अलग कर लिया जाता है।</li>
                <li><b style={{color: "blue"}}>बालू और आयोडीन के मिश्रण के कणों को पृथक करना:</b> इस मिश्रण को गर्म करने पर आयोडीन के कण ऊपर की ओर आते हैं और आयोडीन को अलग कर लिया जाता है।</li>
                <li><b style={{color: "blue"}}>वायु के कणों को पृथक करना:</b> वायु कई गैसों का मिश्रण होता है। इसमें नाइट्रोजन, ऑक्सीजन और कार्बन डाइऑक्साइड गैस पाई जाती हैं। वायु को ठंडा करने पर वह जल में परिवर्तित होते हैं। द्रव को 0°C तक ठंडा करने पर बर्फ में परिवर्तन होता है, और बर्फ को -78°C तक ठंडा करने पर कार्बन डाइऑक्साइड (CO₂) गैस निकलती है।</li>
              </ul>
            </div>
          ),
        },
        {
          question: "20. भौतिक परिवर्तन किसे कहते हैं?",
          answer: (
            <div>
              <b style={{ color: "green" }}>उत्तर:—</b>
              भौतिक परिवर्तन में पदार्थ के गुण में थोड़ा परिवर्तन आता है, लेकिन द्रव्यमान में कोई परिवर्तन नहीं होता है। भौतिक परिवर्तन से कोई नया पदार्थ नहीं बनता है।
              <ul>
                <li><b style={{color: "blue"}}>जल का वाष्प बनना:</b> जल को गर्म करने पर जलवाष्प बनती है, और जलवाष्प को ठंडा करने पर पुनः जल में परिवर्तन हो जाता है।</li>
                <li><b style={{color: "blue"}}>नमक का जल में विलयन:</b> नमक को जल के साथ मिलाने पर नमक जल में घुल जाते हैं, इस विलयन को गर्म करने पर जलवाष्प में परिवर्तन होते हैं और शेष नमक प्राप्त होता है।</li>
                <li><b style={{color: "blue"}}>विद्युत बल्ब से प्रकाश का उत्सर्जन:</b> जब बल्ब से विद्युत धारा प्रवाहित की जाती है, तो बल्ब प्रकाश देने लगता है। बल्ब का जलना एक भौतिक परिवर्तन है।</li>
              </ul>
            </div>
          ),
        },
          {
            question: "21. रासायनिक परिवर्तन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                रासायनिक परिवर्तन में एक नया पदार्थ बनता है और इस पदार्थ के गुण में परिवर्तन आते हैं।
                <ul>
                  <li><b style={{color: "blue"}}>लोहे में जंग लगना:</b> जब लोहे के एक टुकड़े को खुली वायु में रखा जाता है तो लोहे की सतह पर जंग लग जाता है, यह एक रासायनिक परिवर्तन है।</li>
                  <li><b style={{color: "blue"}}>कोयले का जलना:</b> कोयला एक ठोस पदार्थ होता है, जो ऑक्सीजन में जलकर कार्बन डाइऑक्साइड गैस देता है।</li>
                  <li><b style={{color: "blue"}}>शरीर में भोजन का पचना:</b> जब हम भोजन खाते हैं तो वह ऑक्सीकृत होकर ग्लूकोस बनता है।</li>
                </ul>
                <p> <b style={{color: "violet"}}>नोट:—</b> दूध से दही का बनना, फलों का पकना, पत्तों का सूखना, मोमबत्ती का जलना ये सभी रासायनिक परिवर्तन हैं।</p>
              </div>
            ),
          },
          {
            question: "22. भौतिक परिवर्तन और रासायनिक परिवर्तन में क्या अंतर है?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b>
                <p>भौतिक परिवर्तन और रासायनिक परिवर्तन में निम्न अंतर है:</p>
                <ul>
                  <li><b style={{color: "blue"}}>भौतिक परिवर्तन:</b>
                    <ul>
                      <li>भौतिक परिवर्तन से कोई नया पदार्थ नहीं बनता है।</li>
                      <li>भौतिक परिवर्तन में कुछ पदार्थ के रंग रूप बदल जाते हैं।</li>
                      <li>भौतिक परिवर्तन से पदार्थ के द्रव्यमान में कोई परिवर्तन नहीं होता है।</li>
                    </ul>
                  </li>
                  <li><b style={{color: "blue"}}>रासायनिक परिवर्तन:</b>
                    <ul>
                      <li>रासायनिक परिवर्तन से एक नया पदार्थ बनता है।</li>
                      <li>रासायनिक परिवर्तन में पदार्थ के गुण में परिवर्तन होता है।</li>
                      <li>रासायनिक परिवर्तन से पदार्थ के द्रव्यमान में परिवर्तन आता है।</li>
                    </ul>
                  </li>
                </ul>
              </div>
            ),
          },
          {
            question: "23. विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                दो या दो से अधिक पदार्थ का समांग मिश्रण विलयन कहलाता है। 
                <p><b style={{color:"violet"}}> जैसे:—</b> नमक और पानी का समांग मिश्रण विलयन कहलाता है।</p>
              </div>
            ),
          },
          {
            question: "24. विलायक किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                विलयन में जिस पदार्थ का मात्रा ज्यादा हो उसे विलायक कहते हैं।
              </div>
            ),
          },
          {
            question: "25. विलेय किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                विलयन में जिस पदार्थ का मात्रक कम हो उसे विलेय कहते हैं।
                <ul>
                  <li><b style={{color:"violet"}}> जैसे:—</b> (i) नमक (विलेय) + जल (विलायक) → नमक का घोल (विलयन)</li>
                  <li>(ii) चीनी (विलेय) + जल (विलायक) → चीनी का घोल (विलयन)</li>
                </ul>
              </div>
            ),
          },
          {
            question: "26. जलीय विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                जो पदार्थ जल में घुलकर विलयन बनता है, उसे जलीय विलयन कहते हैं।
                <p>नोट:— नमक और जल का विलयन जलीय विलयन कहलाता है।</p>
              </div>
            ),
          },
          {
            question: "27. अजलीय विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                जब एक द्रव किसी दूसरे द्रव में घुलकर विलयन बनता है, उसे अजलीय विलयन कहते हैं।
                <p>नोट:— द्रव और अल्कोहल का मिश्रण अजलीय विलयन कहलाता है।</p>
              </div>
            ),
          },
          {
            question: "28. वास्तविक विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                दो या दो से अधिक पदार्थ का समांग मिश्रण वास्तविक विलयन कहलाता है। वास्तविक विलयन के कणों को हम आसानी से नहीं देख सकते हैं।
                <p>नोट:— नमक, जल का मिश्रण वास्तविक मिश्रण कहलाता है।</p>
              </div>
            ),
          },
          {
            question: "29. वास्तविक विलयन के गुण को लिखें?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                वास्तविक विलयन के गुण निम्नलिखित हैं:
                <ul>
                  <li>वास्तविक विलयन समांग होते हैं, पदार्थ के सभी कण एक समान होते हैं।</li>
                  <li>वास्तविक विलयन को कुछ देर स्थिर छोड़ देने पर विलेय के कण नीचे नहीं बैठते हैं।</li>
                  <li>वास्तविक विलयन के कणों को माइक्रोस्कोप की सहायता से नहीं देख सकते हैं।</li>
                  <li>वास्तविक विलयन को छानकर पृथक नहीं किया जा सकता है।</li>
                </ul>
              </div>
            ),
          },
          {
            question: "30. असंतृप्त विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                असंतृप्त विलयन एक ऐसा मिश्रण होता है जिसमें विलायक में विलेय की कम मात्रा घुली होती है और इसमें और अधिक विलेय मिलाया जा सकता है।
              </div>
            ),
          },
          {
            question: "31. संतृप्त विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                संतृप्त विलयन एक ऐसा मिश्रण होता है जिसमें विलायक में विलेय की अधिकतम मात्रा घुली होती है और इसमें और अधिक विलेय मिलाने पर वह घुलता नहीं है।
              </div>
            ),
          },
          {
            question: "32. अतिसंतृप्त विलयन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                वह संतृप्त विलयन जिसमें विलेय की अधिक मात्रा घुली हो, उसे अतिसंतृप्त विलयन कहते हैं।
              </div>
            ),
          },
          {
            question: "33. निलंबन किसे कहते हैं?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                निलंबन एक विषमांग मिश्रण होता है जिसमें ठोस के कण द्रव या गैस में नहीं घुलते हैं, उसे निलंबन कहते हैं।
                <p><b style={{color:"violet"}}> जैसे:—</b> बालू और जल का मिश्रण निलंबन कहलाता है।</p>
              </div>
            ),
          },
          {
            question: "34. निलंबन के गुण को लिखें?",
            answer: (
              <div>
                <b style={{ color: "green" }}>उत्तर:—</b> 
                निलंबन के गुण निम्नलिखित हैं:
                <ul>
                  <li>निलंबन एक विषमांग मिश्रण होता है।</li>
                  <li>निलंबन में ठोस के कण काफी बड़े होते हैं, इन्हें आँखों से या माइक्रोस्कोप की सहायता से देखा जा सकता है।</li>
                  <li>निलंबन में ठोस के कण छन्ना पत्र को पार नहीं कर सकते हैं।</li>
                  <li>निलंबन के कणों को कुछ देर स्थिर छोड़ने पर ठोस के कण नीचे की ओर आते हैं।</li>
                  <li>निलंबन में ठोस के कणों का आकार 10⁻⁵ सेमी होता है।</li>
                </ul>
              </div>
            ),
          },
            {
              question: "35. कोलाइड किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  कोलाइड विलयन विषमांग मिश्रण होते हैं, जिसमें कणों का आकार वास्तविक विलयन और निलंबन के बीच होता है।
                  <p><b style={{color: "violet"}}>नोट:— </b>दूध, रक्त, धूल कण वायु, बादल, कुहासा कोलाइड विलयन के उदाहरण हैं।</p>
                </div>
              ),
            },
            {
              question: "36. कोलाइड विलयन के गुण को लिखें?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  कोलाइड विलयन के गुण निम्नलिखित हैं:
                  <ul>
                    <li><b style={{color: "blue"}}>कोलाइड विलयन को छानना:</b> कोलाइड के कण छन्ना पत्र को पार कर सकते हैं।</li>
                    <li><b style={{color: "blue"}}>विषमांग मिश्रण:</b> कोलाइड विषमांग मिश्रण होते हैं और इनके कणों को माइक्रोस्कोप की सहायता से देखा जा सकता है।</li>
                    <li><b style={{color: "blue"}}>कोलाइड के कणों का आकार:</b> कोलाइड के कणों का आकार 10⁻⁷ cm और 10⁻⁵ cm के बीच होता है।</li>
                  </ul>
                </div>
              ),
            },
            {
              question: "37. ब्राऊनी गति किसे कहते हैं?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  कोलाइड के कण टेढ़े–मेढ़े गमन करते रहते हैं, इसे ब्राऊनी गति कहते हैं।
                </div>
              ),
            },
            {
              question: "38. टिंडल प्रभाव क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  जब कोलाइड विलयन से प्रकाश को प्रभावित करते हैं, तो कोलाइड के कण गमन करते हुए नजर आते हैं।
                </div>
              ),
            },
            {
              question: "39. वैद्युत कण–संचलन क्या है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  जब कोलाइड विलयन से विद्युत धारा प्रवाहित करते हैं, तो कोलाइड के कण इलेक्ट्रोड पर पहुँचते हैं।
                </div>
              ),
            },
            {
              question: "40. वास्तविक विलयन, कोलाइड विलयन और निलंबन में क्या अंतर है?",
              answer: (
                <div>
                  <b style={{ color: "green" }}>उत्तर:—</b> 
                  वास्तविक विलयन, कोलाइड विलयन और निलंबन में निम्नलिखित अंतर हैं:
                  <ul>
                    <li><b style={{color: "blue"}}>वास्तविक विलयन:</b>
                      <ul>
                        <li>वास्तविक विलयन समांग होते हैं।</li>
                        <li>वास्तविक विलयन में कणों का आकार 10⁻⁸ cm होता है।</li>
                        <li>वास्तविक विलयन के कण नहीं दिखाई देते हैं।</li>
                        <li>वास्तविक विलयन के कण ब्राउनी गति नहीं दिखाते हैं।</li>
                      </ul>
                    </li>
                    <li><b style={{color: "blue"}}>कोलाइड विलयन:</b>
                      <ul>
                        <li>कोलाइड विलयन विषमांग होते हैं।</li>
                        <li>कोलाइड विलयन में कणों का आकार 10⁻⁷ cm से 10⁻⁵ cm होता है।</li>
                        <li>कोलाइड के कणों को माइक्रोस्कोप की सहायता से देखा जा सकता है।</li>
                        <li>कोलाइड विलयन के कण ब्राउनी गति दिखाते हैं।</li>
                      </ul>
                    </li>
                    <li><b style={{color: "blue"}}>निलंबन:</b>
                      <ul>
                        <li>निलंबन भी विषमांग होते हैं।</li>
                        <li>निलंबन में कणों का आकार 10⁻⁵ cm होता है।</li>
                        <li>निलंबन के कणों को माइक्रोस्कोप या आँखों की सहायता से देखा जा सकता है।</li>
                        <li>निलंबन के कण ब्राउनी गति नहीं दिखाते हैं।</li>
                      </ul>
                    </li>
                  </ul>
                </div>
              ),
            },
                  
                
      
      
    
    
  
      
      

         
         
         
         

            ]



              const QuestionAnswerPage = () => {
                return (
                  <div className="p-4">
                    {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
                    {/* <Image sr></Image> */}
                    <div className='flex justify-between'>
                      <div>
                    {/* <Image src={"/image/8th-S-Chap-1.png"} className=' rounded mb-12 transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image> */}
                    </div>
              
                    {/* <div className='border border-x-8  flex flex-col'>
                      <h1>Topics Name</h1>
                      <Link href={"#"}>Chapter 2</Link>
                      <Link href={"#"}>Chapter 3</Link>
                      <Link href={"#"}>Chapter 4</Link>
                      <Link href={"#"}>Chapter 5</Link>
                      <Link href={"#"}>Chapter 6</Link>
                      <Link href={"#"}>Chapter 7</Link>
                    </div> */}
              
                    </div>
              
                    {questions.map((faq, index) => (
                      <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
                        <h3 className="text-xl font-bold text-red-600 mb-2">
                          प्रश्‍न: {faq.question}
                        </h3>
                        <div className="text-xl mt-2">
                          {faq.answer}
                        </div>
                      </div>
                    ))}
                  </div>
                );
              };
              
              export default QuestionAnswerPage;
              
