

import Image from 'next/image';
import Link from 'next/link';
import React from 'react';

const questions = [



  
//     // chapter 8 कोशिका:  संरचना एवं प्रकार्य

//     {
//       chapterName: "कोशिका:  संरचना एवं प्रकार्य",
//       imageUrl: "/image/8th-S-Chap-8.png", // 🖼️ Image for this chapter
//       description: (
//         <h1><b style={{ color: "blue" }}> इस अध्याय में ह उर्वरक।</b></h1>

//       ),
//       questions: [

         {
           question: " 1. कोशिका क्या है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> सजीवों के संरचनात्मक एवं क्रियात्मक इकाई को कोशिका कहते हैं।
             </div>
           ),
         },
         {
           question: " 2. जंतु कोशिका किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जंतुओं के शरीर में पाई जाने वाली कोशिकाएँ जंतु कोशिका कहलाती हैं। इनमें केंद्रक, माइटोकॉन्ड्रिया और लाइसोसोम पाए जाते हैं।
             </div>
           ),
         },
         {
           question: " 3. पादप कोशिका किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> पादप कोशिका पौधों के शरीर में पाई जाने वाली कोशिकाएँ होती हैं। इनमें केंद्रक, माइटोकॉन्ड्रिया, क्लोरोप्लास्ट और सेल्यूलोज़ की दीवार पाई जाती है।
             </div>
           ),
         },
         {
           question: " 4. कोशिकाओं को किस प्रकार देखा जा सकता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कोशिकाओं का आकार बहुत छोटा होता है जिसे देखने के लिए हमें सूक्ष्मदर्शी का प्रयोग करना पड़ता है।
             </div>
           ),
         },
         {
           question: " 5. एक कोशिकीय जीव क्या होता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> वह जीव जो एक ही कोशिका से बना हो वह एक कोशिकीय जीव कहलाता है।
               <br />
             <span style={{color:"violet"}}>  जैसे:—</span> अमीबा और पारामिशियम
             </div>
           ),
         },
         {
           question: " 6. बहुकोशिकीय जीव किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जिन जीवों का शरीर कई कोशिकाओं से मिलकर बना होता है, उन्हें बहुकोशिकीय जीव कहते हैं।
             </div>
           ),
         },
         {
           question: " 7. कोशिका के किस भाग में कोशिकांग पाए जाते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> साइटोप्लाज्मा में।
             </div>
           ),
         },
         {
           question: " 8. उत्तक क्या है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> उत्तक: एक ही प्रकार की कोशिकाओं के समूह को उत्तक कहते हैं। ये कोशिकाएँ आकार, संरचना और कार्य में समान होती हैं।
             </div>
           ),
         },
         {
           question: " 9. उस यंत्र का नाम बताइए जिससे कोशिका को देखा जा सकता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> माइक्रोस्कोप।
             </div>
           ),
         },
         {
           question: " 10. कोशिका के मुख्य अंगत या भाग कौन-कौन से हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका के मुख्य अंगत कोशिका झिल्ली, कोशिका द्रव्य और केंद्रक है।
             </div>
           ),
         },
         {
           question: " 11. कोशिका झिल्ली के अंदर पाये जाने वाले कोशिका अंगको के नाम बताइए?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका द्रव और केंद्रक।
             </div>
           ),
         },
         {
           question: " 12. कोशिका के किस भाग को कोशिका का जीवित पदार्थ कहा जाता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> प्रोटेप्लाजमा को।
             </div>
           ),
         },
         {
           question: " 13. प्रोटेप्लाजमा किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जीवित कोशिका के अंदर के सभी भागों को प्रोटेप्लाजमा कहते हैं।
             </div>
           ),
         },
         {
           question: " 14. जीन किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> जीन: जीन एक अनुवांशिक इकाई है जो क्रोमोसोम में स्थित होती है और जीनेटिक गुणों को एक पीढ़ी से दूसरी पीढ़ी में स्थानांतरित करने में महत्वपूर्ण भूमिका निभाती है।
             </div>
           ),
         },
         {
           question: " 15. किन कोशिकाओं की आकृति निश्‍चित नहीं होती?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> श्‍वेत रक्त कोशिका की आकृति निश्‍चित नहीं होती।
             </div>
           ),
         },
         {
           question: " 16. मानव शरीर में सबसे छोटी एवं बड़ी कोशिका का नाम बताएँ?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> मानव शरीर में लाल रक्त कोशिकाएँ सबसे छोटी होती है। तंत्रिका कोशिका सबसे बड़ी कोशिका होती है।
             </div>
           ),
         },
         {
           question: " 17. ऊतकों का निर्माण किस प्रकार होता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> बहुकोशिकीय जीवों में कोशिकाओं का विशिष्ट समूह ऊतकों का निर्माण करता है।
             </div>
           ),
         },
         {
           question: " 18. मुर्गी के अंडे के पीला भाग एवं उजले भाग को क्या कहा जाता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> मुर्गी के अंडे के पीले भाग को एलब्यूमिन तथा उजला भाग योक कहलाता है। मुर्गी का यह अंडा एकल कोशिका रखता है।
             </div>
           ),
         },
         {
           question: " 19. कोशिका का आकार किस बात पर निर्भर करता है?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका का आकार का संबंध किसी जीव या पौधे के आकार से न होकर उस कोशिका विशेष के कार्य से होता है।
             </div>
           ),
         },
         {
           question: " 20. क्लोरोफिल या पर्णहरित किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> पत्तियों का हरा रंग उनकी कोशिकाओं में स्थित हरे रंग के लवक क्लोरोप्लास्ट या हरित लवक के कारण होता है, जिसे क्लोरोफिल पर्णहरित कहते हैं।
             </div>
           ),
         },
         {
           question: " 21. कोशिका झिल्ली किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> कोशिका झिल्ली एक पतली और लचीली परत होती है जो कोशिका के अंदरूनी हिस्से को बाहरी वातावरण से अलग करती है। यह झिल्ली कोशिका को सुरक्षा प्रदान करती है और पदार्थों के आदान-प्रदान को नियंत्रित करती है।
             </div>
           ),
         },
         {
           question: " 22. कोशिका भित्ति किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> पादप कोशिकाओं की बाहरी परत जो सेल्यूलोज़ से बनी होती है और कोशिका को आकार और संरचना प्रदान करती है।
             </div>
           ),
         },
         {
           question: " 23. केंद्रक झिल्ली किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> केंद्रक के चारों ओर स्थित एक दोहरी झिल्ली जो केंद्रक को कोशिका के सायटोप्लाज्म से अलग करती है और केंद्रक में आने-जाने वाले पदार्थों को नियंत्रित करती है।
             </div>
           ),
         },
         {
           question: " 24. रंजक किसे कहते हैं?",
           answer: (
             <div>
               <b style={{ color: "green" }}>उत्तर:—</b> रंजक: कोशिका में पाए जाने वाले रंगीन पदार्थों को रंजक कहते हैं। ये पदार्थ कोशिका को विशिष्ट रंग प्रदान करते हैं और अक्सर कोशिका की विशिष्ट कार्यों में भी भूमिका निभाते हैं।
               <br />
               <b style={{ color: "violet" }}>
                 रंजकों के उदाहरण:
               </b>
               <ul className="ml-16">
                 <li><span style={{ color: "red" }}>क्लोरोफिल:</span> पादप कोशिकाओं में पाया जाने वाला एक रंजक जो पौधों को हरा रंग प्रदान करता है और प्रकाश संश्‍लेषण में महत्वपूर्ण भूमिका निभाता है।</li>
                 <li><span style={{ color: "red" }}>हीमोग्लोबिन:</span> जंतु कोशिकाओं में पाया जाने वाला एक रंजक जो लाल रक्त कोशिकाओं में पाया जाता है और ऑक्सीजन को शरीर के विभिन्न अंगों तक पहुंचाने में मदद करता है।</li>
                 <li><span style={{ color: "red" }}>मेलानिन:</span> जंतु कोशिकाओं में पाया जाने वाला एक रंजक जो त्वचा, बालों और आंखों को रंग प्रदान करता है।</li>
               </ul>
             </div>
           ),
         },
         {
           question: " 25. जंतु कोशिका और पादप कोशिका में क्या अंतर है?",
           answer: (
             <div>
               <p>
                 <b style={{ color: "green" }}>उत्तर:—</b> <span style={{ color: "blue" }}> जंतु कोशिका और पादप कोशिका में निम्न अंतर है: </span>
               </p>
               <ul className="ml-16">
                 <li><span style={{ color: "red" }}>पादप कोशिका में:</span>
                   <ul className="ml-2">
                     <li>कोशिका भित्ति होती है।</li>
                     <li>क्लोरोप्लास्ट होते हैं।</li>
                     <li>वैक्यूल्स बड़े होते हैं।</li>
                     <li>लाइसोसोम नहीं होते हैं।</li>
                     <li>सेंट्रियोल नहीं होते हैं।</li>
                   </ul>
                 </li>
                 <li><span style={{ color: "red" }}>जंतु कोशिका में:</span>
                   <ul className="ml-2">
                     <li>कोशिका भित्ति नहीं होती है।</li>
                     <li>क्लोरोप्लास्ट नहीं होते हैं।</li>
                     <li>वैक्यूल्स छोटे होते हैं।</li>
                     <li>लाइसोसोम होते हैं।</li>
                     <li>सेंट्रियोल होते हैं।</li>
                   </ul>
                 </li>
               </ul>
             </div>
           ),
         },
//       ]

//     },


//       ]
//     },









    
]



const QuestionAnswerPage = () => {
    return (
      <div className="p-4">
        {/* <h1 className="text-2xl font-bold mb-6">प्रश्न और उत्तर</h1> */}
        {/* <Image sr></Image> */}
        <div className='flex justify-between'>
          <div>
        <Image src={"/image/8th-S-Chap-8.png"} className=' rounded mb-12transition-all transform hover:animate-shake' width={2500} height={300} alt='img'></Image>
        </div>
  
        {/* <div className='border border-x-8  flex flex-col'>
          <h1>Topics Name</h1>
          <Link href={"#"}>Chapter 2</Link>
          <Link href={"#"}>Chapter 3</Link>
          <Link href={"#"}>Chapter 4</Link>
          <Link href={"#"}>Chapter 5</Link>
          <Link href={"#"}>Chapter 6</Link>
          <Link href={"#"}>Chapter 7</Link>
        </div> */}
  
        </div>
  
        {questions.map((faq, index) => (
          <div key={index} className="mb-8 border-b-2 border-gray-300 pb-4">
            <h3 className="text-xl font-bold text-red-600 mb-2">
              प्रश्‍न: {faq.question}
            </h3>
            <div className="text-xl mt-2">
              {faq.answer}
            </div>
          </div>
        ))}
      </div>
    );
  };
  
  export default QuestionAnswerPage;